[
    {
        "id": "1gu32g2",
        "title": "Shipping 200kg from Malaga to Niamey",
        "content": "Trying to find a service/company who’ll ship so expedition gear (about 200kg overall) from Malaga to Niamey. \n\nNot on pallets. Whole shipment can probably fit on 3 pallets. \n\nAnybody knows companies/logistic brokers who can take on that?",
        "subreddit": "logistics",
        "author": "Obvious_Law6783",
        "upvotes": 2,
        "created_at": "2024-11-18T11:57:41+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gu32g2/shipping_200kg_from_malaga_to_niamey/",
        "comments": [
            {
                "author": "PJ-time",
                "content": "Not many forwarders will have service to Niger. Air freight will be your easiest option but you will need to check aircraft size before packing your pallets as there maybe size and weight restrictions. \n\nYou could try Vanguard or AGS for LCL options as they may have road onforwarding services through Mali. \n\nOr work backwards and use someone like AGL Niger. They have an agent network and can arrange all the way through and will sort customs clearance for you. \nhttps://www.aglgroup.com/en/transport-logistics-africa/niger/\n\nYour documentation will need to be correct for the import. This is where most people have issues when shipping into West Africa. Also make sure you understand duty and taxes % so you don’t get caught out. Request a DDP rate. (Delivered Duties Paid)\n\nGood luck",
                "upvotes": 1,
                "created_at": "2024-11-18T12:26:36+00:00"
            },
            {
                "author": "ancientwithin",
                "content": "I work at a logistics company called SME-Europe, if you are looking for an option, contact [transport@sme-europe.com](mailto:transport@sme-europe.com) with your shipment details. :)",
                "upvotes": 1,
                "created_at": "2024-11-18T12:57:34+00:00"
            }
        ]
    },
    {
        "id": "1gtimij",
        "title": "what are some entry level jobs in logistics?",
        "content": "I am completing a supply chain and operations diploma and wanted to know what are some entry level jobs in logistics for someone with no experience in this industry? \n\nThanks :))",
        "subreddit": "logistics",
        "author": "letsjustnotplease09",
        "upvotes": 13,
        "created_at": "2024-11-17T17:24:56+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gtimij/what_are_some_entry_level_jobs_in_logistics/",
        "comments": [
            {
                "author": "Interesting-Year2015",
                "content": "try starting in an assistant role, like a freight broker assistant or logistics coordinator. you can learn a lot in these jobs by watching how things work and figure out what part of logistics interests you most.",
                "upvotes": 10,
                "created_at": "2024-11-17T18:04:51+00:00"
            },
            {
                "author": "Idont_know2022",
                "content": "Logistics coordinator",
                "upvotes": 7,
                "created_at": "2024-11-17T17:30:35+00:00"
            },
            {
                "author": "Maleficent-Theory908",
                "content": "Procurement, Pricing analyst. What city are you in or near?",
                "upvotes": 3,
                "created_at": "2024-11-17T17:34:10+00:00"
            },
            {
                "author": "AboveTheNorm",
                "content": "Related question, sort of.\n\nI work for a small company, and job labels are really non existent.\n\nMy job persist of sending quotes to carriers for outbound furniture, as well as notifying clients and communicating with them about their furniture deliveries. I decide the need of getting the furniture to them promptly, but not overpay for the services.\n\nAdditionally (and more recently), I’ve been handling international inbounds, both communicating with vendors, our buyers, and our freight broker. I also, on occasion, fill out the necessary forms to get items through customs using UPS, DHL, and FedEx.\n\nA lot of this was established prior to me being in this role, but I’ve also added some spreadsheets for myself, as well as others, and have found some of the carriers we currently use.\n\nI still have so much to learn because this is mostly self learned. I’m 8 months in on outbound logistics, and not even a month in on inbound logistics. What would my job occupation be!?",
                "upvotes": 3,
                "created_at": "2024-11-17T19:29:40+00:00"
            },
            {
                "author": "goodwill65",
                "content": "Do Cargowise certifications. Niche skill and will take 2-3 months and currently it's open and free",
                "upvotes": 3,
                "created_at": "2024-11-17T20:15:00+00:00"
            }
        ]
    },
    {
        "id": "1gszxj0",
        "title": "Opinions about salary",
        "content": "I want ya'lls opinion about salary, yes Houston TX. Consultant. Currently working for a Consultant firm, 6 months. 8 years experience in my field in México. Was a very good fit for this job to attend customer that has operations in USA factories in México and customers around the world. Doing general consulting, origin determinations for different FTAs and all FTA management (end to end) and HTS codes classifications for all projects of this customer. Also we are expanding the FTA management to LATAM. How much should I make? Masters in customs law. ",
        "subreddit": "logistics",
        "author": "1998TJgdl",
        "upvotes": 4,
        "created_at": "2024-11-16T23:25:03+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gszxj0/opinions_about_salary/",
        "comments": [
            {
                "author": "WatchOutForDeer12",
                "content": "Masters in customs law at a top 10 consulting firm should pull median 200k including bonuses. Sorta depends on the client and size of program. Bigger the project in value, the bigger haul you should expect. You got a tough job to benchmark with others though.",
                "upvotes": 4,
                "created_at": "2024-11-16T23:30:51+00:00"
            },
            {
                "author": "Suitable-Scholar-778",
                "content": "Following",
                "upvotes": 1,
                "created_at": "2024-11-17T02:56:59+00:00"
            },
            {
                "author": "Interesting-Year2015",
                "content": "with 8 yrs experience + a master’s degree you should prob be in the $80-100k range (or more). sounds like you’re bringing a lot to the table too, so def don’t lowball yourself buddy.",
                "upvotes": 1,
                "created_at": "2024-11-18T08:25:16+00:00"
            }
        ]
    },
    {
        "id": "1gsv37y",
        "title": "What 6 figure job in logistics has the easiest skill set to learn?",
        "content": "Title",
        "subreddit": "logistics",
        "author": "IanFrankenstein",
        "upvotes": 0,
        "created_at": "2024-11-16T19:36:09+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gsv37y/what_6_figure_job_in_logistics_has_the_easiest/",
        "comments": [
            {
                "author": "thejordanianone",
                "content": "Depends. I’m an import logistics manager at that pay level with no specific logistics or scm training. Learn your company’s business and make it better.\n\nEdit: I realize that might have come across as smug which was not my intention. There’s luck and timing involved, I joined an organization that was rapidly growing. But my main point was to really hone in on what your business does and find measurable ways to improve it.",
                "upvotes": 6,
                "created_at": "2024-11-16T22:28:04+00:00"
            },
            {
                "author": "Idont_know2022",
                "content": "It depends on your job. But I would say logistics coordinator",
                "upvotes": 4,
                "created_at": "2024-11-16T20:15:19+00:00"
            },
            {
                "author": "mattdamonsleftnut",
                "content": "Easily analyst.",
                "upvotes": 6,
                "created_at": "2024-11-16T21:29:25+00:00"
            },
            {
                "author": "WatchOutForDeer12",
                "content": "Account executive",
                "upvotes": 2,
                "created_at": "2024-11-18T04:26:04+00:00"
            },
            {
                "author": "Interesting-Year2015",
                "content": "Analyst roles  are probably the easiest entry points",
                "upvotes": 1,
                "created_at": "2024-11-17T13:45:00+00:00"
            }
        ]
    },
    {
        "id": "1gsps57",
        "title": "Is A SCM Certificate worth it Canada",
        "content": "I'm thinking of taking 3 courses in winter at my old University for supply chain management and logistics  certificate.  My only issue is, will it actually get me anywhere?  I want to work  in customs brokerage or be a buyer, but all the jobs require university degrees in business orna college degree in logistics.  Do certificates actually do anything?",
        "subreddit": "logistics",
        "author": "Every-Split-3257",
        "upvotes": 1,
        "created_at": "2024-11-16T15:35:30+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gsps57/is_a_scm_certificate_worth_it_canada/",
        "comments": [
            {
                "author": "Suitable-Scholar-778",
                "content": "Yes.",
                "upvotes": 1,
                "created_at": "2024-11-16T17:24:50+00:00"
            }
        ]
    },
    {
        "id": "1gs2bab",
        "title": "Boss wants to get back on Prime",
        "content": "We ship out of the north east.\nPeak season is 3500-4000 orders six days a week (April - June)\nThese can be oversized / non case shipments so likely would need someone to ship on our accounts. Would love to cover as much of the country in Zone 4 as possible.\n\nLooking for a 3PL partner with West (Reno perhaps), Texas focused (OKC?) and Southeast.\n\nAny thoughts?",
        "subreddit": "logistics",
        "author": "silver_sAUsAGes",
        "upvotes": 2,
        "created_at": "2024-11-15T17:55:34+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gs2bab/boss_wants_to_get_back_on_prime/",
        "comments": [
            {
                "author": "RetroShip",
                "content": "We have one location (AZ), but I own and operate Retroship.\n\nYou are welcome to use your own carriers or ours, whatever saves you the most in shipping (we have fantastic rates with UPS for larger shipments).",
                "upvotes": 2,
                "created_at": "2024-11-15T23:55:08+00:00"
            },
            {
                "author": "fleetwood96",
                "content": "Followed up with a DM!",
                "upvotes": 1,
                "created_at": "2024-11-15T18:05:42+00:00"
            },
            {
                "author": "KEIGHWAR",
                "content": "Dm’d",
                "upvotes": 1,
                "created_at": "2024-11-15T18:54:59+00:00"
            },
            {
                "author": "Mirimirii",
                "content": "If you are looking in Midwest, I can help",
                "upvotes": 1,
                "created_at": "2024-11-15T21:58:33+00:00"
            },
            {
                "author": "Comedy1010",
                "content": "DM’d. Based in reno. Warehouse, capacity, let me know!",
                "upvotes": 1,
                "created_at": "2024-11-15T22:33:20+00:00"
            }
        ]
    },
    {
        "id": "1grvuzl",
        "title": "3PL Question",
        "content": "I’m looking for a reliable 3PL company with a good reputation for my online clothing brand e-com store. I’m in the USA so I’d prefer them to be in the US as well but also have international shipping. I’ll usually have around 200-1000 items with roughly 15-20 different SKU’s. I’ll get my manufacturer to send to them at a single time, they store and ship those items when needed precisely. What are some good choices?  ",
        "subreddit": "logistics",
        "author": "InternationalSkin302",
        "upvotes": 10,
        "created_at": "2024-11-15T13:02:56+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1grvuzl/3pl_question/",
        "comments": [
            {
                "author": "pleaseleevmealone",
                "content": "Oh man, your poor DMs. \n\nThe biggest (most expensive) players in the game are Geodis and Radial. You are probably looking for a bit smaller based on your volume. 3PLs price based on storage, pick and pack, and shipping. In my experience ShipBob and Cart.com are hit and miss by location. Stord is a shitshow, but may be a good fit for a smaller brand like yours. They just bought some excellent pitney bowes facilities. Pick a provider based on proximity to your average customer, tour the facility and ask lots of questions about their processes. Good luck!",
                "upvotes": 6,
                "created_at": "2024-11-15T16:10:06+00:00"
            },
            {
                "author": "SHFJ4-4",
                "content": "Warehut is probably your best option.",
                "upvotes": 2,
                "created_at": "2024-11-16T03:11:34+00:00"
            },
            {
                "author": "freightforwardus",
                "content": "So what exactly are you looking for the 3PL to do? Warehousing, shipping, and international? Would the 3PL be doing pick and pack at the warehouse? Are these coming/going palletized? Couple different things to think about when searching for a 3PL",
                "upvotes": 1,
                "created_at": "2024-11-15T15:01:29+00:00"
            },
            {
                "author": "dskot",
                "content": "AMZ Worldwide",
                "upvotes": 1,
                "created_at": "2024-11-15T19:03:55+00:00"
            },
            {
                "author": "Tall_Category_304",
                "content": "Austin? That you?",
                "upvotes": 1,
                "created_at": "2024-11-15T21:32:40+00:00"
            }
        ]
    },
    {
        "id": "1grsi4x",
        "title": "Do you have Warehouse space utilization problem?",
        "content": "I am trying to research on warehouse spacing issue.  \nand feel like in this sub-reddit there are some amazing people with 15-20years of experience.  \n  \nWould love to know how you are solving your warehousing space utilization.\n\nI am sure no one can utilize 100% but I want to know what you guys are using to utilize maximum you can or if you have given up on it would love to know about that.",
        "subreddit": "logistics",
        "author": "unluckybitch18",
        "upvotes": 5,
        "created_at": "2024-11-15T09:16:59+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1grsi4x/do_you_have_warehouse_space_utilization_problem/",
        "comments": [
            {
                "author": "scmsteve",
                "content": "Old saying \" if you can't grow out, grow up\". The upper shelves tend to be under utilized when space is not an issue.",
                "upvotes": 3,
                "created_at": "2024-11-15T13:44:54+00:00"
            },
            {
                "author": "pleaseleevmealone",
                "content": "Constant, systematic pallet consolidation.",
                "upvotes": 3,
                "created_at": "2024-11-15T16:29:21+00:00"
            },
            {
                "author": "NighthawkT42",
                "content": "Are you looking to sell something? This feels like an ad.",
                "upvotes": 2,
                "created_at": "2024-11-15T10:55:10+00:00"
            },
            {
                "author": "scmsteve",
                "content": "Warehouse over 85% capacity begins to lose efficiency, and continues to more inefficient as capacity goes up.",
                "upvotes": 2,
                "created_at": "2024-11-16T15:50:23+00:00"
            },
            {
                "author": "Interesting-Year2015",
                "content": "space utilization is always a struggle lol. biggest game-changer for us has been investing in better racking systems and reworking our pick paths to save space. also, doing regular audits to clear out dead stock helps a ton. what’s your setup like?",
                "upvotes": 2,
                "created_at": "2024-11-17T17:34:54+00:00"
            }
        ]
    },
    {
        "id": "1gqud69",
        "title": "DRG UN3481 & 3091 QUESTION",
        "content": "I have tried so hard to find an existing answer...I couldn't find anything concrete. Based on the language in IATA, it sounds like I can use one label/mark to mark a package as containing UN3091 and UN3481 without special shipping requirements outside the normal packing instructions. Am I correct? I couldn't find any labels that already existed, which is understandable because his feels niche. Getting one made is not an issue for me, I just wanted verification this was allowed.",
        "subreddit": "logistics",
        "author": "Monochromelace",
        "upvotes": 6,
        "created_at": "2024-11-14T02:19:04+00:00",
        "url": "https://www.reddit.com/gallery/1gqud69",
        "comments": [
            {
                "author": "mattdamonsleftnut",
                "content": "Just take pictures and ask your airline if this will pass. You’re gonna need a 49cfr document as well. \n\nWhat do you consider normal packing instructions?",
                "upvotes": 4,
                "created_at": "2024-11-14T03:16:13+00:00"
            },
            {
                "author": "DVOlimey",
                "content": "Read the DGR regs on overpack also. If you are in doubt, ask an IATA approved DGR packer  to assist you.",
                "upvotes": 2,
                "created_at": "2024-11-14T05:33:30+00:00"
            },
            {
                "author": "Monochromelace",
                "content": "Update to anyone who cares: IATA allows a mix label. In their battery guide, FAQ J states it can be a mix label.\n\nI had to reach out to UPS hazmat support, IATA is very difficult to get in contact with, but if you make a combo label it should read as \"UN[Number] & UN[Number]\" specifically regarding the Lithium Battery Mark in 7.1.5.5. Support was clear it just needs the \"&\" symbol and both UN codes.\n\nhttps://www.iata.org/contentassets/05e6d8742b0047259bf3a700bc9d42b9/lithium-battery-guidance-document.pdf",
                "upvotes": 2,
                "created_at": "2024-11-14T21:41:20+00:00"
            },
            {
                "author": "baileynkalua",
                "content": "I believe you have to have the proper labels for both UN numbers. This may help you\n\nhttps://images.fedex.com/content/dam/fedex/apac-asia-pacific/downloads/fedex-lithium-battery-guide-en-tw.pdf",
                "upvotes": 1,
                "created_at": "2024-11-14T04:20:13+00:00"
            },
            {
                "author": "TripUpset398",
                "content": "look under transport details",
                "upvotes": 1,
                "created_at": "2024-11-14T04:27:11+00:00"
            }
        ]
    },
    {
        "id": "1gqhrt6",
        "title": "Looking for a US T86 entry broker for ecommerce goods entering by truck from Canada",
        "content": "Hi r/Logistics\n\nI consult for an organization that is looking for a US customs broker that can handle T86 entries for ecommerce for goods that cross the northern border by truck. Entry volume per day is around 5,000, increasing at peak. They ship six days a week, year round. Only a portion of these daily entries are on the table for this opportunity, but it is a permanent opportunity, and the percentage of entries to be filed as T86 will probably increase as regulatory ramps up in the US.\n\nThey're an experienced ecommerce 3PL with a stable client and commodity base. The client themselves holds all required FDA, Health Canada and other licenses or registrations. *This is not a marketplace like TEMU etc.* The clients have a mix of non-regulated and regulated products. Food, Dietary Supplements, general consumer household goods etc. COO is mixed but mostly COO US, Canada or China. These are currently cleared with a mix of S321, T86, informal and formal entries depending on the situation. They're looking for aggressive pricing from a broker well experienced in ecommerce that can handle mass submissions of entries (Excel template upload or API/EDI).\n\nThey're very savvy on compliance and IT fronts. The commodities don't change frequently - these are well known brands and products with long product lifecycles - again, this is *not* a marketplace. These are de minimis imports of the same product day in, day out, each to a new consignee.\n\nDesired launch date is ASAP - they could start sending entries as soon as next week if the right partner is found.\n\nThey are looking to speak only with brokers who are well experienced with ecommerce T86. The daily trucking could be on the table in the future as well depending on the partner. This is potentially a multi-million dollar per year account for a brokerage / forwarder with the right service and product lineup. DM me for more detail and if you think you have a solution.",
        "subreddit": "logistics",
        "author": "takeoff_power_set",
        "upvotes": 3,
        "created_at": "2024-11-13T17:06:07+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gqhrt6/looking_for_a_us_t86_entry_broker_for_ecommerce/",
        "comments": [
            {
                "author": "WolverinePrimary1802",
                "content": "I can help you. Send me a message.",
                "upvotes": 2,
                "created_at": "2024-11-14T13:40:52+00:00"
            },
            {
                "author": "Suitable-Scholar-778",
                "content": "Good luck in your search",
                "upvotes": 1,
                "created_at": "2024-11-13T22:09:55+00:00"
            },
            {
                "author": "Responsible_Value878",
                "content": "We might be able to help your client out, who should I reach out to?",
                "upvotes": 1,
                "created_at": "2024-11-15T00:00:21+00:00"
            },
            {
                "author": "Sharp-Letter-3586",
                "content": "Good evening I would be happy to connect my team. I work with the nation's 2nd leading brokerage. What is the best way to directly get in touch?",
                "upvotes": 1,
                "created_at": "2024-11-16T02:31:45+00:00"
            }
        ]
    },
    {
        "id": "1gqh5p2",
        "title": "Seeking Qualified Individual for FMC License",
        "content": "Hello Everyone,\n\nMy company is looking for a QI to obtain its OTI license from the FMC. Please apply at this [indeed posting](https://www.indeed.com/job/qualifying-individual-qi-ocean-transportation-intermediary-oti-license-48e73ec60c2fa94a?_gl=1*1j39nsk*_gcl_au*OTMxNDI4OTM1LjE3MzE0MTgyNDQ.*_ga*MjY2NjI5Mzc1LjE3MzE0MTgxMzc.*_ga_5KTMMETCF4*MTczMTUxNTY0NC41LjEuMTczMTUxNTY1Mi41Mi4wLjA.*_fplc*TFZMVllyUmg4b2VOaFUyNEZkZW93RlRaSU5IVEVNd3F1UE9nWHFCeHluZ3psbWtWNkVFcFd5cm5GJTJGc0F6aTFleWtnJTJGSGRvcU5neCUyRkRrc013OVN2YiUyQklQNmgxNU9WRE5JbXZ4M3k3d1poeFMlMkZTRHBMZWYlMkYzSVk4amRncFFRJTNEJTNE).",
        "subreddit": "logistics",
        "author": "Early-Cup-9872",
        "upvotes": 2,
        "created_at": "2024-11-13T16:40:42+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gqh5p2/seeking_qualified_individual_for_fmc_license/",
        "comments": [
            {
                "author": "Maleficent-Theory908",
                "content": "Curious, what do you think you will do differently to compete with all the big brands who have market advantages?",
                "upvotes": 1,
                "created_at": "2024-11-13T23:34:21+00:00"
            },
            {
                "author": "Fragrant_Click8136",
                "content": "DM",
                "upvotes": 1,
                "created_at": "2024-11-16T04:17:03+00:00"
            },
            {
                "author": "Interesting-Year2015",
                "content": "Just dropping a comment to help with visibility – hope you find the right candidate soon!",
                "upvotes": 1,
                "created_at": "2024-11-18T08:28:00+00:00"
            }
        ]
    },
    {
        "id": "1gqcc28",
        "title": "Is there a name for this service? And is it common?",
        "content": "We’re a 3PL with 2 warehouses. A potential client has his own warehouse already and all his staff but they have no WMS and nobody internally to be able to implement one. (They tried a year ago, spent $150k and failed) \n\nSo we’re discussing with them that we would add a warehouse to our WMS, onboard them, train their staff to use our system. \n\nBenefit would be smooth on-boarding, support (we’re 5 minutes away), use of our carrier prices. \n\nBut we would not technically operate daily activities there.\n\nSo my question is, is this common? Does it have a name? ",
        "subreddit": "logistics",
        "author": "Wyvern78",
        "upvotes": 2,
        "created_at": "2024-11-13T13:01:03+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gqcc28/is_there_a_name_for_this_service_and_is_it_common/",
        "comments": [
            {
                "author": "PreludeTilTheEnd",
                "content": "Consulting",
                "upvotes": 11,
                "created_at": "2024-11-13T15:01:56+00:00"
            },
            {
                "author": "RealMacMittens",
                "content": "This sounds almost like SaaS (software as a service) if all you're providing them with is a WMS and training.",
                "upvotes": 7,
                "created_at": "2024-11-13T15:44:47+00:00"
            },
            {
                "author": "Bearjupiter",
                "content": "I wouldn’t say its common but as long as its minimal to no risk for you, with an adequate agreement and compensation- why not?\n\nYou’d also have access to the data which could be valuable.\n\nThe opportunity I see here, is when the lease is up on their current space, on board them into your company - since all the data and set up will be there.",
                "upvotes": 6,
                "created_at": "2024-11-13T15:45:16+00:00"
            },
            {
                "author": "eseerms",
                "content": "I would avoid this at all costs.  The IT side of this could become a nightmare if things go south.",
                "upvotes": 2,
                "created_at": "2024-11-13T20:01:49+00:00"
            },
            {
                "author": "Baconaise",
                "content": "I always love hearing this because so many companies blow $100k or more when typical onboarding fees are closer to $5-20k for a single warehouse and annual service fees are closer to $20k-40k for most of the modern saas softwares we hear about people implementing\n\nBut fuck modern saas for not having a pushy sales rep showing up at your door asking for quadruple the price I guess.",
                "upvotes": 2,
                "created_at": "2024-11-13T22:45:11+00:00"
            }
        ]
    },
    {
        "id": "1gq7no1",
        "title": "advise for a new sale man",
        "content": "Hello everyone, I am new to the B2B sales market. My company is in the transportation business. I am currently taking my first steps. My boss has set KPIs for meeting customers. But it seems difficult, because when I call customers, they only give me 1 minute to talk and then hang up. I am here to ask for your advice on how to create meetings with customers.",
        "subreddit": "logistics",
        "author": "Famous-Row-7464",
        "upvotes": 4,
        "created_at": "2024-11-13T07:35:12+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gq7no1/advise_for_a_new_sale_man/",
        "comments": [
            {
                "author": "RealMacMittens",
                "content": "In sales, you have 10 seconds to say something important/interesting or they're done listening. Also, stop talking for a minute straight, you should be doing more listening than talking.",
                "upvotes": 6,
                "created_at": "2024-11-13T16:15:24+00:00"
            },
            {
                "author": "SixSevenTwo",
                "content": "I work brokering. I get multiple calls everyday from the same type of folks offering the same type of thing at similar costing. You need to set yourself apart. You also should know the industry you are trying to service.  \n\nI.e knowing peak seasons / slow downs ect.  if someone tries to call me between now and thanksgiving to get onboardered you are more likely to get your email black listed. Whereas the end of Dec / Jan I'm far more likely to hear you out.",
                "upvotes": 2,
                "created_at": "2024-11-14T05:45:21+00:00"
            },
            {
                "author": "djupton20",
                "content": "Fuck cold calls, emails are the way to go. Come up with a solid template differentiating yourself and your company and outline specific ways you can take the stress of transportation off their shoulders. You should also ask your company if they use zoominfo or have a login. Literally the best possible site for prospecting.",
                "upvotes": 2,
                "created_at": "2024-11-15T16:24:47+00:00"
            },
            {
                "author": "Interesting-Year2015",
                "content": "welcome to the grind, man. key is to keep it short and focus on their pain points and don’t sell right away. also, follow up with emails sometimes they respond better that way. it’s all about persistence.",
                "upvotes": 2,
                "created_at": "2024-11-17T13:48:15+00:00"
            },
            {
                "author": "Dapper-Cress5570",
                "content": "If you get even a minute of their time, make sure you’re prepared and ready to deliver exactly what they need right off the bat.. There are some great sales books worth checking out, like the challenger sale and the science of selling. Another approach is to go where your prospects hang out and connect with them directly.",
                "upvotes": 1,
                "created_at": "2024-11-13T10:26:27+00:00"
            }
        ]
    },
    {
        "id": "1gq72uk",
        "title": "Need help: Shipping a container from Luxembourg to Ireland",
        "content": "Hi all, does anyone know a service to ship an used 20foot/6m container from Luxembourg to Ireland. Apparently the fact that it is second hand makes it more complicated. Does anyone of you have any idea how to do this? Thanks in advance!",
        "subreddit": "logistics",
        "author": "Pijean",
        "upvotes": 3,
        "created_at": "2024-11-13T06:53:23+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gq72uk/need_help_shipping_a_container_from_luxembourg_to/",
        "comments": [
            {
                "author": "LogisticsProConnect",
                "content": "Any reputable freight forwarder should be able to help. DB Schenker, CH Robinson, Hellmann Worldwide, Kuehne + Nagel, etc. These are the big players in the industry, but there are plenty of mid-size FF’s that can provide great service as well.",
                "upvotes": 1,
                "created_at": "2024-11-14T16:04:03+00:00"
            },
            {
                "author": "Sharp-Letter-3586",
                "content": "What is the best way to directly contact you? I work out of a metro TQL office in Michigan. Can get you some fair pricing on this, door to door with customs if needed.",
                "upvotes": 1,
                "created_at": "2024-11-16T02:44:23+00:00"
            },
            {
                "author": "SjordenD",
                "content": "Why a container? Usual trucking would be much easier.",
                "upvotes": 1,
                "created_at": "2024-11-16T10:17:29+00:00"
            },
            {
                "author": "Interesting-Year2015",
                "content": "a freight forwarder is definitely what you’re looking for. companies like Kuehne + Nagel, DB Schenker, or DocShipper can help handle this kind of shipment. do you have any specific timelines or need help with customs? that info can help narrow down the right service for you.",
                "upvotes": 1,
                "created_at": "2024-11-17T18:12:51+00:00"
            }
        ]
    },
    {
        "id": "1gq2a53",
        "title": "Looking for recommendations for Excel/Python courses for operational logistics",
        "content": "Hello,\n\nCany anyone recommend any Excel/Python courses for operational (day to day) logistics? Thank you.",
        "subreddit": "logistics",
        "author": "seanmurraywork",
        "upvotes": 4,
        "created_at": "2024-11-13T02:15:42+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gq2a53/looking_for_recommendations_for_excelpython/",
        "comments": [
            {
                "author": "Puzzleheaded_Loss433",
                "content": "cs50 p for python, What do you need it for?",
                "upvotes": 2,
                "created_at": "2024-11-14T09:08:42+00:00"
            },
            {
                "author": "Ok-Status-7877",
                "content": "udemy has decent courses usually cheap af on sale.but tbh, I doubt that you can find a course just for logistics.. it's more like: learn the basics first then apply it to your stuff. Also, youtube is your best friend lol.",
                "upvotes": 2,
                "created_at": "2024-11-17T12:21:25+00:00"
            },
            {
                "author": "Interesting-Year2015",
                "content": "honestly, thats too specific, you might not find a course that’s designed for logistics tasks. i’d say learn the basics of excel or python first (plenty of free stuff on youtube), then figure out how to apply it to your daily ops.",
                "upvotes": 2,
                "created_at": "2024-11-17T13:16:14+00:00"
            }
        ]
    },
    {
        "id": "1gpqi00",
        "title": "Air freight rates",
        "content": "Is there a website that lets you know the buy-rate for air freight? Other than webcargo…..",
        "subreddit": "logistics",
        "author": "Ok-Contribution-8776",
        "upvotes": 2,
        "created_at": "2024-11-12T17:42:31+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gpqi00/air_freight_rates/",
        "comments": [
            {
                "author": "PreludeTilTheEnd",
                "content": "Cargoai.co",
                "upvotes": 1,
                "created_at": "2024-11-12T18:07:17+00:00"
            },
            {
                "author": "Philip_Caps",
                "content": "[freightos.com](http://freightos.com)",
                "upvotes": 1,
                "created_at": "2024-11-13T04:02:57+00:00"
            },
            {
                "author": "DVOlimey",
                "content": "Aircon.ai if ex USA",
                "upvotes": 1,
                "created_at": "2024-11-13T10:51:48+00:00"
            },
            {
                "author": "Dry-Assist-402",
                "content": "Excargo",
                "upvotes": 1,
                "created_at": "2024-11-16T21:24:39+00:00"
            },
            {
                "author": "Interesting-Year2015",
                "content": "I use [airrates.com](http://airrates.com)",
                "upvotes": 1,
                "created_at": "2024-11-17T18:36:05+00:00"
            }
        ]
    },
    {
        "id": "1gpp5ht",
        "title": "Transferable skills?",
        "content": "Greetings everyone, \n\nI have been in a logistics role as a 3PL for about a year now. I am with a large corporation and we serve external customers in rail exclusively. \n\nWhile I do enjoy this position, I plan on moving to another state in the next year or so. I am wondering if I should stay in rail because it is such a niche that takes time to learn and understand in depth or if I should be looking outside my experience? I know the skills are transferable in the logistics space, and serving external customers I could go into an array of account management for B2B but that’s beside the point. \n\nShould I be looking at jobs in rail or expand my horizons into other logistics roles such as procurement, trucking, etc. \n\nWho’s hiring remotely or in the PNW? ",
        "subreddit": "logistics",
        "author": "CarterTheWay",
        "upvotes": 3,
        "created_at": "2024-11-12T16:47:06+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gpp5ht/transferable_skills/",
        "comments": [
            {
                "author": "reabsco",
                "content": "Rail is a cluster Fck and if you can learn it quickly, then that knowledge will transfer to other modes. Absolutely, do not limit yourself to rail only. Multi-modal customers will appreciate someone that knows different ways they can save $ or different services. It's going to Ruth Chris's and always getting the salad. It's good but don't limit yourself.",
                "upvotes": 2,
                "created_at": "2024-11-12T17:07:26+00:00"
            },
            {
                "author": "squarepeg101",
                "content": "Niche roles are a double edge sword...you'll have trouble finding the perfect fit, but when you do you are in high demand without much competition.    I suggest trying to get on the shipper side as a in house logistics manager.    \nYour experience will make you a Rockstar in house.",
                "upvotes": 1,
                "created_at": "2024-11-12T23:10:41+00:00"
            }
        ]
    },
    {
        "id": "1gpn12d",
        "title": "Looking for Software to Create a Question-Chain for Vendor Selection",
        "content": "Hey everyone! I’m searching for software or a tool that allows me to set up a kind of “question chain” for narrowing down a vendor list based on quote requests. The ideal setup would ask me a sequence of questions (like \"Is the shipment refrigerated?\" -> If yes, \"Is the destination international?\" etc.), helping me narrow down the list with each question. At the end, it would show all vendors that match the criteria based on my answers.\n\nDoes anyone know of any programs that could do this efficiently? Bonus points if it’s customizable so we can add or change questions over time. Any advice or recommendations would be amazing!",
        "subreddit": "logistics",
        "author": "ancientwithin",
        "upvotes": 1,
        "created_at": "2024-11-12T15:17:27+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gpn12d/looking_for_software_to_create_a_questionchain/",
        "comments": [
            {
                "author": "Muqtasid",
                "content": "Typeform",
                "upvotes": 1,
                "created_at": "2024-11-12T15:19:21+00:00"
            },
            {
                "author": "Prize_Bass_5061",
                "content": "Who has this vendor list information? Is it information you have collected that you need to filter through. Or is it functionality you need to provide for someone else.\n\nExcel is the easiest way to do this for yourself. If that won’t work you’ll need a custom program.",
                "upvotes": 1,
                "created_at": "2024-11-12T17:06:02+00:00"
            },
            {
                "author": "squarepeg101",
                "content": "Viscosoftware.com. 100% customizable.    We'd house all your vendor data and you could easily sorr/filter appropriately.   Quotes/opportunity flow straight into PO/Sales management, to inventory and logistics and documentation.",
                "upvotes": 1,
                "created_at": "2024-11-13T09:34:10+00:00"
            }
        ]
    },
    {
        "id": "1gpl3mp",
        "title": "Finding Chicagoland intermodal?",
        "content": "Checking to see if anyone has any pointers how to get setup to be able to move intermodal out of Chicagoland going west?",
        "subreddit": "logistics",
        "author": "ACupOfCheese",
        "upvotes": 0,
        "created_at": "2024-11-12T13:47:54+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gpl3mp/finding_chicagoland_intermodal/",
        "comments": [
            {
                "author": "Interesting_Bit_7950",
                "content": "I can assist",
                "upvotes": 1,
                "created_at": "2024-11-12T14:34:12+00:00"
            },
            {
                "author": "freightforwardus",
                "content": "Would you be looking to set-up yourself or go through a brokerage for it?",
                "upvotes": 1,
                "created_at": "2024-11-12T15:05:43+00:00"
            },
            {
                "author": "Ornery-Ideal5708",
                "content": "Let me know if you still finding options",
                "upvotes": 1,
                "created_at": "2024-11-12T17:00:22+00:00"
            },
            {
                "author": "Turbulent-Walrus6292",
                "content": "Call JB Hunt or Hub Group. 2 of the largest carriers that run IM on the BNSF.",
                "upvotes": 1,
                "created_at": "2024-11-13T05:43:29+00:00"
            },
            {
                "author": "EmergencyExample1582",
                "content": "US1 logistics",
                "upvotes": 1,
                "created_at": "2024-11-15T18:20:09+00:00"
            }
        ]
    },
    {
        "id": "1gpigo1",
        "title": "How do you make profit with truck transport?",
        "content": "Hello everyone,\n\nI’m reaching out because I’m really struggling to figure out how to at least make even in today’s market. It feels impossible with the constantly rising costs in Europe and clients who expect top-notch work but want to pay less and less. I have a great team, and we’re equipped to handle the work, but I just don’t see how small and medium businesses are surviving this pressure.\n\nFor context, I (inherited and now) run a trucking company. We’ve downsized our fleet recently because post-COVID demand dropped off, and the competition is fierce everyone seems to be fighting over even the lowest prices. It feels like an attrition war, and I’m not sure how other companies make this work, is it even possible to work given the current market?\n\nHow do you manage the current situation?\n\nThanks in advance for any insights.",
        "subreddit": "logistics",
        "author": "ExtraThickDaddy",
        "upvotes": 9,
        "created_at": "2024-11-12T11:19:34+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gpigo1/how_do_you_make_profit_with_truck_transport/",
        "comments": [
            {
                "author": "No_Acanthisitta2746",
                "content": "Specialise, general freight is a race to the bottom. I work to find customers with specialist needs they will pay more and trust you.",
                "upvotes": 11,
                "created_at": "2024-11-12T11:27:40+00:00"
            },
            {
                "author": "iolitm",
                "content": "You can't. I would sell the business honestly. It's not going to get better in the next 5 years.",
                "upvotes": 8,
                "created_at": "2024-11-12T12:14:07+00:00"
            },
            {
                "author": "Dapper-Cress5570",
                "content": "Seems like a challenging time these days. But what i found can be helpful is try to be more focused and specialised. In this case, been working in food industry in Nordics and finding the right transport is the killer.",
                "upvotes": 5,
                "created_at": "2024-11-12T13:02:32+00:00"
            },
            {
                "author": "SixSevenTwo",
                "content": "Specialized freight. Reefers make good money it's what I work in but brokering / logistics management for a company. I will always pay a bit more to keep my regular  guys happy and  running my loads I know there aren't any headaches and if they do have them I don't hear about it until the problem is resolved, that's what I expect. We used to have so many problems using like load link with random bottom of the barrel carriers I was always  doing like 20+ hours in ot just to deal with folks like that... let alone late pickups having staff stay to load trailers ect.",
                "upvotes": 3,
                "created_at": "2024-11-12T17:03:55+00:00"
            },
            {
                "author": "Fragrant_Click8136",
                "content": "It’s a very broad post - how do you make a profit truck transport? Where are you? What country or region are you offering the service? How many trucks and drivers do you have? What is the age of your vehicles? Do you small trucks or large trucks - what commodities does your company hauls? Are an open deck or van company…",
                "upvotes": 2,
                "created_at": "2024-11-12T14:13:00+00:00"
            }
        ]
    },
    {
        "id": "1gpi1gt",
        "title": "How long does DHL typically take to respond to a job application?",
        "content": "Anyone with a relevant experience that can offer their insights? Your addition the conversation would be even more beneficial if you applied to a position in a foreign country as I did.",
        "subreddit": "logistics",
        "author": "IanFrankenstein",
        "upvotes": 4,
        "created_at": "2024-11-12T10:50:43+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gpi1gt/how_long_does_dhl_typically_take_to_respond_to_a/",
        "comments": [
            {
                "author": "FreightTechGuy",
                "content": "It may take them a little longer than usual right now, as they are selling off their brokerage division to Jack Cooper.",
                "upvotes": 4,
                "created_at": "2024-11-12T14:30:04+00:00"
            },
            {
                "author": "iolitm",
                "content": "Be happy you applied. I can't apply coz there are no job openings in my city and the recruiter is being a Kant.",
                "upvotes": 1,
                "created_at": "2024-11-12T12:31:31+00:00"
            },
            {
                "author": "FilthyLikeGorgeous",
                "content": "weeks",
                "upvotes": 1,
                "created_at": "2024-11-14T01:56:58+00:00"
            }
        ]
    },
    {
        "id": "1gort26",
        "title": "Best way to send parcel from uk to Lithuania",
        "content": "Any other services apart from Royal Mail that people have used ? Trying to send a gift to my friend. (Candles, tea and that kind of stuff)",
        "subreddit": "logistics",
        "author": "vvixio",
        "upvotes": 1,
        "created_at": "2024-11-11T13:09:42+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gort26/best_way_to_send_parcel_from_uk_to_lithuania/",
        "comments": [
            {
                "author": "Objective_Effort2235",
                "content": "DHL is typically an affordable and reliable option, I'd recommend looking for a quote with them: \n\nhttps://parcel.dhl.co.uk/parcel-delivery-to-lithuania/",
                "upvotes": 1,
                "created_at": "2024-11-11T18:48:27+00:00"
            }
        ]
    },
    {
        "id": "1gormch",
        "title": "Trucking and unloading services for FCL shipments from Hamburg port.",
        "content": "I need trucking and unloading services for FCL shipments from Hamburg port. I've contacted several but so far no hope, all full capacity. Any recommendation?",
        "subreddit": "logistics",
        "author": "Acceptable_Square878",
        "upvotes": 3,
        "created_at": "2024-11-11T13:00:38+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gormch/trucking_and_unloading_services_for_fcl_shipments/",
        "comments": [
            {
                "author": "Maleficent_Impact989",
                "content": "Pm me let me see if I can maybe help",
                "upvotes": 2,
                "created_at": "2024-11-12T22:38:27+00:00"
            },
            {
                "author": "No-Middle-3669",
                "content": "Pm me , maybe i can help",
                "upvotes": 2,
                "created_at": "2024-11-13T18:38:58+00:00"
            },
            {
                "author": "Sharp-Letter-3586",
                "content": "What is the best way to get in touch with you? I work within a brokerage that uses our chassis to pull from ports. Let me know",
                "upvotes": 1,
                "created_at": "2024-11-16T02:47:56+00:00"
            }
        ]
    },
    {
        "id": "1go3rl3",
        "title": "MSC in the MSC only stack",
        "content": "",
        "subreddit": "logistics",
        "author": "Sir_Baconstrips",
        "upvotes": 143,
        "created_at": "2024-11-10T15:58:08+00:00",
        "url": "https://i.redd.it/14dbz6kuj30e1.jpeg",
        "comments": [
            {
                "author": "wreckognize",
                "content": "Fuck MSC. Worst customer service ever.",
                "upvotes": 40,
                "created_at": "2024-11-10T16:16:21+00:00"
            },
            {
                "author": "Ten-4RubberDucky",
                "content": "Meanwhile drivers are in 8-hour delays waiting on the lift operators to load them.",
                "upvotes": 14,
                "created_at": "2024-11-10T16:52:04+00:00"
            },
            {
                "author": "McSterling83",
                "content": "Nice call. Where is this?",
                "upvotes": 4,
                "created_at": "2024-11-10T16:04:16+00:00"
            },
            {
                "author": "DVOlimey",
                "content": "Italians based in Switzerland), superb company",
                "upvotes": 2,
                "created_at": "2024-11-10T21:45:32+00:00"
            },
            {
                "author": "ChickenSudden2153",
                "content": "looks cool",
                "upvotes": 1,
                "created_at": "2024-11-11T13:29:23+00:00"
            }
        ]
    },
    {
        "id": "1go1pht",
        "title": "What issues do you commonly face in Warehousing",
        "content": "Hi,  \nJust a tech guy trying to do market research.  \nDo you use any software to manage in ? or any internal team or something like that?\n\nYou can also fill this ***anonymous*** survey  \n[https://tally.so/r/wb40go](https://tally.so/r/wb40go)",
        "subreddit": "logistics",
        "author": "unluckybitch18",
        "upvotes": 6,
        "created_at": "2024-11-10T14:21:45+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1go1pht/what_issues_do_you_commonly_face_in_warehousing/",
        "comments": [
            {
                "author": "scmsteve",
                "content": "Warehouse space utilization. Not sure if there is any software for this. It’s a very tedious task but necessary when you start running out of space.",
                "upvotes": 7,
                "created_at": "2024-11-10T14:46:42+00:00"
            },
            {
                "author": "SubieNoobieTX",
                "content": "\n\nWMS systems that are tacked on as an after thought to ERP.",
                "upvotes": 3,
                "created_at": "2024-11-10T15:01:54+00:00"
            },
            {
                "author": "Homes2001",
                "content": "Anyone facing challenges with billing? Different pricing models / prices, missing revenue, intransparent reporting?",
                "upvotes": 3,
                "created_at": "2024-11-10T18:36:02+00:00"
            },
            {
                "author": "dumpsterfire_account",
                "content": "Staffing challenges are huge. Carriers in my space all pick up and deliver at the same times, there’s a huge rush of deliveries between 10am and 1pm and a huge rush of pickups between 3 and 5pm.\n\nPoor staffing optimization leads to long wait times for carriers causing either missed pickups or detention charges.\n\nFulfillment center response is usually to come at different times, which in the LTL world is infeasible.\n\nIdeally other warehouse staff could be trained on dock duties to come lend a hand during the rushes. ODFL as a carrier hires or trains dock staff with CDLs so if someone needs to run freight out in a truck urgently, they can send a dock worker instead of waiting for a driver.",
                "upvotes": 2,
                "created_at": "2024-11-12T11:17:50+00:00"
            },
            {
                "author": "edhdz1",
                "content": "Interesting question, curious to know what type of response you get. What is the end goal of your research?",
                "upvotes": 1,
                "created_at": "2024-11-10T14:42:53+00:00"
            }
        ]
    },
    {
        "id": "1gnnhwc",
        "title": "Looking to buy a USA 3PL.",
        "content": "DM if you’re looking to sell! :)",
        "subreddit": "logistics",
        "author": "Defiant-Rabbit-841",
        "upvotes": 1,
        "created_at": "2024-11-09T23:53:18+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gnnhwc/looking_to_buy_a_usa_3pl/",
        "comments": [
            {
                "author": "StolenLabias",
                "content": "What multiple are you paying ?",
                "upvotes": 2,
                "created_at": "2024-11-10T13:20:19+00:00"
            },
            {
                "author": "RedkikinIt2023",
                "content": "When you close… hit me up and let’s get you integrated with transactional shippers interest policies. Redkik.com attn: Petey",
                "upvotes": 1,
                "created_at": "2024-11-13T12:44:16+00:00"
            },
            {
                "author": "needhelptoday2023",
                "content": "DMing you",
                "upvotes": 0,
                "created_at": "2024-11-10T00:42:24+00:00"
            }
        ]
    },
    {
        "id": "1gndmxh",
        "title": "OBL question",
        "content": "Hello- first import so forgive the newbie question. I have engaged a fright forwarder to do door-to-door delivery, importing to a residential address in the US.\n\nI just received an email that is an arrival notice, emailed to both me (consignee) and my freight forwarder contacts. The email is stating 1st OBL is required. \n\nDoes the freight forwarder handle the OBL.or is that something I (consignee) need to put together? I'm using the forwarders in-hour customs broker if that matters. \n\nTrying to be proactive and make sure I'm not letting anything fall through the cracks.Thank you!",
        "subreddit": "logistics",
        "author": "No_UN216",
        "upvotes": 5,
        "created_at": "2024-11-09T16:19:55+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gndmxh/obl_question/",
        "comments": [
            {
                "author": "RuthIessChicken",
                "content": "The carrier issues the original bill of lading and your forwarder should handle all the communication with the carrier on your behalf.  You don't have to \"put together\" the OBL, it should be presented to you.",
                "upvotes": 2,
                "created_at": "2024-11-09T19:06:01+00:00"
            },
            {
                "author": "No_Acanthisitta2746",
                "content": "Your forwarder should get the OBL and produce a house bill off the back this.",
                "upvotes": 2,
                "created_at": "2024-11-09T19:36:55+00:00"
            },
            {
                "author": "mlopez1120",
                "content": "OBL is released once payment is sent to whomever contracted the vessel for transport. It’s used by manufacturers to ensure they get their payment before releasing goods to consignee at destination port. Especially for first time buyers who don’t have an established relationship with shipper.",
                "upvotes": 1,
                "created_at": "2024-11-09T22:47:21+00:00"
            },
            {
                "author": "golfsnow08",
                "content": "you can also request your shipper to telex release it, but some forwarder charges telex fee, usually $35",
                "upvotes": 1,
                "created_at": "2024-11-10T00:25:53+00:00"
            },
            {
                "author": "SorbetShort9191",
                "content": "Have you paid your supplier? If yes then ask them to arrange a Telex release which is much faster. Otherwise you will need to lodge all 3 copies of the original bill of lading to the shipping line",
                "upvotes": 1,
                "created_at": "2024-11-12T11:48:27+00:00"
            }
        ]
    },
    {
        "id": "1gmxokq",
        "title": "Received an offer as an Air Export Coordinator. Any insights on my possible role?",
        "content": "My background is in communications and administration. This is my first professional job out of college and I am excited and anxious at the same time.\n\nI read other people's post similar to my situation and they were told to learn this and that, which were abbreviated terms I encountered for the first time. I want to do well in this role and I want to welcome any advice you can provide.\n\nFive years from now, I still desire to work in communications/administrative roles and I hope you could also provide advice on how I can optimize and make most of my employment to help me for the future.",
        "subreddit": "logistics",
        "author": "PandaSun_ChocoRising",
        "upvotes": 7,
        "created_at": "2024-11-09T00:33:41+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gmxokq/received_an_offer_as_an_air_export_coordinator/",
        "comments": [
            {
                "author": "WhytePumpkin",
                "content": "Be prepared to kiss goodbye to your Friday night plans for the foreseeable future, you'll be cranking out AWBs and sending prealerts instead",
                "upvotes": 14,
                "created_at": "2024-11-09T00:52:05+00:00"
            },
            {
                "author": "Ok_Basket_5439",
                "content": "you better send me those AWB drafts asap boii",
                "upvotes": 4,
                "created_at": "2024-11-09T19:35:27+00:00"
            },
            {
                "author": "iolitm",
                "content": "How did you get a job offer to job you don't know about?\n\nHow did you get it? What company? Are they still hiring?",
                "upvotes": 3,
                "created_at": "2024-11-09T00:53:39+00:00"
            },
            {
                "author": "Status-Accountant-94",
                "content": "Congratulations on the offer! For your Air Export Coordinator role, focus on learning logistics terms (like INCOTERMS, ETA, and HAWB), stay organized, and ask questions. Build relationships with colleagues to expand your skills. In 5 years, seek opportunities that blend logistics and your communications expertise!",
                "upvotes": 2,
                "created_at": "2024-11-11T10:44:51+00:00"
            },
            {
                "author": "mattdamonsleftnut",
                "content": "Watch YouTube videos. You’ll get a general sense of what to expect",
                "upvotes": 1,
                "created_at": "2024-11-09T01:57:03+00:00"
            }
        ]
    },
    {
        "id": "1gmx3r1",
        "title": "Rates question for SoCal",
        "content": "Hey All, \n\nI used to have my own trucking company some years back and am looking to get back into it but I’m curious as to what current market rates are, to be specific I owned 53 dry vans and hauled FTLs in SoCal local only .. can anyone here PLEASE help maybe research a couple lanes on a load board and help tell me what rates are posted? \n\nLanes if you can search please are the following \n\nCommerce,CA to Fontana, CA .. with a 20 mile radius for each \n\nMira Loma, CA to Montebello,CA with same 20 mile radius \n\nI just want to get an idea of what the market looks like .. also if you can please tell me how many loads there are posted \n\nThank you so much in advance!",
        "subreddit": "logistics",
        "author": "Imaginary-Field496",
        "upvotes": 2,
        "created_at": "2024-11-09T00:05:48+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gmx3r1/rates_question_for_socal/",
        "comments": [
            {
                "author": "DwayneBaconStan",
                "content": "How far out will you go from Ontario",
                "upvotes": 1,
                "created_at": "2024-11-09T00:10:27+00:00"
            },
            {
                "author": "PreludeTilTheEnd",
                "content": "$450.",
                "upvotes": 1,
                "created_at": "2024-11-09T01:30:00+00:00"
            },
            {
                "author": "Rjskill3ts21",
                "content": "I got like 3-5 flatbed loads a day SoCal",
                "upvotes": 1,
                "created_at": "2024-11-09T15:55:58+00:00"
            }
        ]
    },
    {
        "id": "1gmv16b",
        "title": "Best TMS software for carriers, brokers, and hybrid logistics company",
        "content": "I'm looking for suggestions. My husband owns a carrier company and a brokerage. We do about 200 loads/month, have 10 trucks FTL in the United states!",
        "subreddit": "logistics",
        "author": "Jojo_Marie",
        "upvotes": 4,
        "created_at": "2024-11-08T22:30:49+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gmv16b/best_tms_software_for_carriers_brokers_and_hybrid/",
        "comments": [
            {
                "author": "Scrivenerson",
                "content": "Excel is the right answer. \n\nAlternatively go for a free TMS first to figure out what is actually useful to you. The biggest one is:\n\nhttps://www.thefreetms.com/features-and-benefits",
                "upvotes": 6,
                "created_at": "2024-11-09T05:54:33+00:00"
            },
            {
                "author": "rasner724",
                "content": "Excel. You guys don’t do enough to afford what you are describing. It’s not necessary.",
                "upvotes": 8,
                "created_at": "2024-11-08T23:22:50+00:00"
            },
            {
                "author": "Dry-Assist-402",
                "content": "What do you mean by hybrid? Do you guys have broker authority?",
                "upvotes": 2,
                "created_at": "2024-11-09T01:11:48+00:00"
            },
            {
                "author": "lalafied",
                "content": "\nTransplus fleet manager \n\nTrimble truckmate",
                "upvotes": 1,
                "created_at": "2024-11-09T03:16:43+00:00"
            },
            {
                "author": "armyfrog84",
                "content": "Check out tmsez.com\nSuper affordable and Sam the owner is a great guy!!",
                "upvotes": 1,
                "created_at": "2024-11-09T05:25:25+00:00"
            }
        ]
    },
    {
        "id": "1gmtiyj",
        "title": "Need help shipping to China",
        "content": "I gotta send my phone back for repairs.  So far USPS is the only one that Is able to ship my product because \\`Kwun Tong, Kowloon, Hong Kong\\` does not have a zip code, while the other shipping companies in the US require a zip code.\n\nProblem is that USPS will not ship cell phones because they have a lithium battery...  Am I just SOL?  Looks like it's impossible.",
        "subreddit": "logistics",
        "author": "TOG_WAS_HERE",
        "upvotes": 3,
        "created_at": "2024-11-08T21:24:26+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gmtiyj/need_help_shipping_to_china/",
        "comments": [
            {
                "author": "dylpepper",
                "content": "Where specifically are you shipping from?",
                "upvotes": 1,
                "created_at": "2024-11-08T21:39:26+00:00"
            },
            {
                "author": "PreludeTilTheEnd",
                "content": "Can you take the battery out and not ship it?",
                "upvotes": 1,
                "created_at": "2024-11-08T23:15:17+00:00"
            },
            {
                "author": "Eastern_East_96",
                "content": "Kowloon still fucking exists?",
                "upvotes": 1,
                "created_at": "2024-11-09T06:13:36+00:00"
            },
            {
                "author": "chrisrozon",
                "content": "There’s gotta be more to this story",
                "upvotes": 1,
                "created_at": "2024-11-09T07:29:18+00:00"
            },
            {
                "author": "reabsco",
                "content": "www.pirateship.com",
                "upvotes": 1,
                "created_at": "2024-11-10T22:05:40+00:00"
            }
        ]
    },
    {
        "id": "1gmpgqk",
        "title": "What's the legal limit for a carrier to approve or deny a damage claim?",
        "content": "In a nutshell, I have some carriers who pay out within 30 days and others take many months. \n\nThe ones who take a long time then ask me to salvage the material which by that point has been tossed in the trash and they then refuse to pay out.",
        "subreddit": "logistics",
        "author": "Firm-Faithlessness81",
        "upvotes": 5,
        "created_at": "2024-11-08T18:29:57+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gmpgqk/whats_the_legal_limit_for_a_carrier_to_approve_or/",
        "comments": [
            {
                "author": "prayersforrain",
                "content": "There isn’t? I believe this would be covered under any standard terms and conditions your company would have with said carrier.",
                "upvotes": 7,
                "created_at": "2024-11-08T18:45:54+00:00"
            },
            {
                "author": "WatchOutForDeer12",
                "content": "Should be clearly stated in your master agreement with the carrier. If it isn’t an MSA. Good luck on holding anyone to a timeline",
                "upvotes": 2,
                "created_at": "2024-11-08T19:21:49+00:00"
            },
            {
                "author": "Firm-Faithlessness81",
                "content": "Forgot to mention I'm in Canada. I know there are certain legal provisions on how long you have to file or send notice of the damage/loss claim. \n\nWas hoping there was something applying to the carriers end of the process as my sales/claims team thinks it's crazy to ask a client to keep the damaged material for longer than 90 days. \n\nHeck I'd bet most of our clients toss the material after a week.",
                "upvotes": 1,
                "created_at": "2024-11-08T20:00:03+00:00"
            },
            {
                "author": "BoundedGolf529",
                "content": "Should be in your contract of carriage? Is it international transport or no?",
                "upvotes": 1,
                "created_at": "2024-11-08T22:56:33+00:00"
            },
            {
                "author": "Dry-Assist-402",
                "content": "Yeah there isn’t unfortunately. Don’t forget this is insurance we’re talking about lol. I own a 3PL and I have a client currently with a claim and I settled with them for an immediate cash value so they don’t have to wait. The insurance company will cut the check for us if there is one. Ask your broker if they can do something similar",
                "upvotes": 1,
                "created_at": "2024-11-09T01:06:19+00:00"
            }
        ]
    },
    {
        "id": "1gmne4m",
        "title": "Brokers for LTL freight from Socal to NorCal lanes? Also courier broker to access UPS, DHL, FEDEX anywhere in US",
        "content": "Looking for recommended brokers to check out for shipments out of Ontario, CA to northern CA like Redding, Eureka, etc. Afraid to get bombarded with messages from reps, would greatly appreciate recommendations on what you use so I can check out 🙂 \n\nThanks!",
        "subreddit": "logistics",
        "author": "theseawoof",
        "upvotes": 6,
        "created_at": "2024-11-08T17:03:32+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gmne4m/brokers_for_ltl_freight_from_socal_to_norcal/",
        "comments": [
            {
                "author": "stinky_pinky_brain",
                "content": "RIP your inbox.",
                "upvotes": 3,
                "created_at": "2024-11-08T18:35:51+00:00"
            },
            {
                "author": "FilthyLikeGorgeous",
                "content": "DPHE (Dependable Highway Express) they were just bought by AAA Cooper",
                "upvotes": 3,
                "created_at": "2024-11-08T22:42:51+00:00"
            },
            {
                "author": "DwayneBaconStan",
                "content": "Well if you want someone to move it, you can send me a dm. I do stuff out of Ontario",
                "upvotes": 2,
                "created_at": "2024-11-08T17:07:22+00:00"
            },
            {
                "author": "rasner724",
                "content": "For LTL?? Do you guys just not have anyone in accounting? Just go direct!",
                "upvotes": 1,
                "created_at": "2024-11-08T20:21:49+00:00"
            },
            {
                "author": "Narrow_Emergency6599",
                "content": "Hey, try [boxton.com](http://boxton.com)",
                "upvotes": 1,
                "created_at": "2024-11-08T21:19:53+00:00"
            }
        ]
    },
    {
        "id": "1gmn3of",
        "title": "Warehouse Pricing models",
        "content": "I am curious about how sales reps present warehouse models to customers. Multiple SKU, Pick/Pack, Inbound/Outbound, Storage, and Containers. I have yet to find a simple way to present that doesn't confuse the shit out of them. Thoughts? Are there any online companies that present online pricing models?",
        "subreddit": "logistics",
        "author": "reabsco",
        "upvotes": 4,
        "created_at": "2024-11-08T16:51:31+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gmn3of/warehouse_pricing_models/",
        "comments": [
            {
                "author": "rasner724",
                "content": "Let me help, this is what I present on the majority of my time.\n\nSo there are 5 primary costs that are associated with a warehouse and how much service you ask for. Ranges from simple intake to actual 4PL models.\n\nThey are:\n\n1. In/out - which should encompass everything as far as offload/reload, getting it to its spot and any sort labeling that they do internally.\n\n2. Storage - self explanatory \n\n3. Order Entry - so this every time an order is sent. It doesn’t matter how many shipments this results in, there’s a charge. \n\n4. Pick & Pack - this is if you client has multiple sku’s and they send you FCLs/FTLs with one sku that eventually need to be broken down to create a pallet with multiple sku’s on it.\n\n5. Additional material, labor, etc. - this is like pallet charges, wrapping charges, man labor if a container tipped over and you need someone to restack this etc.\n\nIf you do international: customs, ocean/air etc. is next. Then final mile charges. Then if you have a WMS system and they want to be able to login, you’ll need to charge them an integration fee (and bump the order entry fee to make up for all the fees of them inputting loads now)\n\nFor reference, I own 200K sq ft in Miami. We have FTZ space and bonded space, the below is about an avg. charge per the above scope:\n\n1. $20/$20\n2. $35\n3. $22\n4. $0.65\n5. Varies\n\nHope this helps.",
                "upvotes": 8,
                "created_at": "2024-11-08T20:21:14+00:00"
            },
            {
                "author": "charlesholmes1",
                "content": "I've helped 3PLs develope thier pricing sheet. But full transparency, I do charge for this.",
                "upvotes": 2,
                "created_at": "2024-11-08T18:46:43+00:00"
            }
        ]
    },
    {
        "id": "1gmg93a",
        "title": "What to read about world-wide steel-iron production",
        "content": "like the modern(starting from 19th century to current) steps of delivering ore from mines to the supplying final/intermediate(like if its a construction or a car manufacturing company) consumer with metal products(bolts, kitchen utensils, electronics, factory machinery, different vehicles from cranes to cars and tanks)\n\n  \ni know that no book is vast enough to cover all from economics of 3 centuries in this industry, to current world wide infrastructure and supply chains but it will be still helpful\n\na jstor article maybe too",
        "subreddit": "logistics",
        "author": "yoaahh",
        "upvotes": 2,
        "created_at": "2024-11-08T11:19:37+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gmg93a/what_to_read_about_worldwide_steeliron_production/",
        "comments": [
            {
                "author": "yoaahh",
                "content": "what subreddit am i better ask this at then?",
                "upvotes": 1,
                "created_at": "2024-11-08T15:42:52+00:00"
            }
        ]
    },
    {
        "id": "1gm3ir1",
        "title": "CRC 16 Authentication - What is it?",
        "content": "We are being asked to submit a CRC 16 Authentication for shipments but nobody knows what the heck it is. Can anyone enlighten me?",
        "subreddit": "logistics",
        "author": "Pancer_Manda",
        "upvotes": 1,
        "created_at": "2024-11-07T22:48:43+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gm3ir1/crc_16_authentication_what_is_it/",
        "comments": [
            {
                "author": "sump_daddy",
                "content": "I know this is old and you probably found the answer or moved on but... CRC16 is a check digit calculator formula used with number sequences. One logistics example is serialized container codes, you need a check digit to confirm the rest of the code because of how easy it is for a long barcode to contain errors.  So they were likely telling you that shipment data needs the CRC16 check digit added to the container codes, PRO numbers, or other sequence youre using on your labels/paperwork.",
                "upvotes": 2,
                "created_at": "2024-11-15T14:32:32+00:00"
            }
        ]
    },
    {
        "id": "1glvt11",
        "title": "How do you cope up with the Stress?",
        "content": "I work at a 3PL and looking after shipments of around 60 FFE per week. Recently I’ve stated to feel overwhelming by managing multiple issues at the same time and I have to take care of vendor management, warehousing, carrier management and client management. It’s getting stress full for me to remember every bit of exceptions and communications from each parties. How do you cope up with such situation? ",
        "subreddit": "logistics",
        "author": "crack71",
        "upvotes": 16,
        "created_at": "2024-11-07T17:23:51+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1glvt11/how_do_you_cope_up_with_the_stress/",
        "comments": [
            {
                "author": "bdb5780",
                "content": "I used to do that, before ChAtGPT I had a set process to CM(Y)A. My boss hated my email system (inbox zero) with folders for everything based on the segment (Shipper, Carrier, origin agent, destination agent, trucker, etc) I did this with 125 shipments a week, FCL, LCL and Air. Having it all organized made things so much easier. Combining that with Quick steps and reminders saved me sooo many headaches. \n\nUltimately you need to teach your people (origin, shipper, destination agent, trucker, etc) how you want/expect things. Once you get that done it runs smooth, things happen but as long as you plan and prepare you should be fine. If you don't do anything, that's when the stress happens. \n\nAutomate as much as you can and look at the process constantly to see how you can simplify it. \n\nI use Chat GPT and other AI programs hourly to make adjustments. \n\nCarriers will respond to you if you threaten to take the work if they aren't doing it to the level you need. Short pay for incorrect ppwk and be on the lookout for new carriers.",
                "upvotes": 12,
                "created_at": "2024-11-07T17:36:04+00:00"
            },
            {
                "author": "scmsteve",
                "content": "Two main points from much experience here:\n1. Stress is often the bi-product of poor time management. Not always but often. If you designate 30 min time periods throughout the day for different task, you will find that you can dip into the most major parts of your AOR each day. You have to stick with it. If something urgent comes up and requires your immediate attention (always, I  know) then do it and return to your task window of time. \n\n2. Those of us that are diligent tend to take things personally when they don’t go as planned. If there are things not under your direct control, let that shit go. I took all failures of other people and it ate me up. I’m speaking mainly of internal operations like sales or finance. If it’s a vendor making your life miserable, replace them. If it employees that report to you, replace them. But let what you can’t fully control go.",
                "upvotes": 4,
                "created_at": "2024-11-07T20:45:40+00:00"
            },
            {
                "author": "lazysmartdude",
                "content": "The most important lesson I learned in the last decade is that everyone thinks their request is the most urgent. \n\n\nEverything is important in your role, this is not being disputed. \n\n\nIt is up to you to take that step back from the urgent request you received while working on the other urgent request you received earlier to breath and not fall for the faux pressure being put on you. You know what will take 10 minutes and what will take 2 hours, not the person on the other end of the phone/email.\n\n\nPersonally, I start the day and bang out the quick tasks first. Then move onto the more detailed requests, and towards the end of the day start on the newest requests. \n\n\nI do get pulled away from this plan throughout the day to handle truly urgent and time sensitive items and that's ok. Handle that and then get back to the plan you made at the start of the day. \n\n\nAs other commentors have said, this is all about time management in the end and having an understanding of your abilities and your company and customers needs overall will help you navigate each day. There is always tomorrow and there is always more.",
                "upvotes": 3,
                "created_at": "2024-11-07T21:57:16+00:00"
            },
            {
                "author": "WatchOutForDeer12",
                "content": "I sip whiskey",
                "upvotes": 3,
                "created_at": "2024-11-08T04:09:28+00:00"
            },
            {
                "author": "Interesting-Year2015",
                "content": "Man, that sounds rough. honestly, the best way to deal with this kinda stress is to stop trying to keep everything in your head: write stuff down or use some tools to track it all. also, remember you’re not a superhero; delegate when you can, and let some stuff wait if it’s not urgent. and seriously, take a break when it’s all too much.. you’ll do better after clearing your head a bit. (at least that's what worked for me).",
                "upvotes": 2,
                "created_at": "2024-11-18T08:43:07+00:00"
            }
        ]
    },
    {
        "id": "1glssd5",
        "title": "IS there any platform like Timocom for FCL?",
        "content": "Title, looking to find FCL loads for my trucks, need a marketplace type site like timo or transEU.",
        "subreddit": "logistics",
        "author": "Deqzjoker",
        "upvotes": 1,
        "created_at": "2024-11-07T15:16:48+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1glssd5/is_there_any_platform_like_timocom_for_fcl/",
        "comments": [
            {
                "author": "zbub88",
                "content": "Evotrux?",
                "upvotes": 1,
                "created_at": "2024-11-08T00:15:48+00:00"
            },
            {
                "author": "CerdoUK23",
                "content": "Teleroute for Europe",
                "upvotes": 1,
                "created_at": "2024-11-08T00:34:14+00:00"
            }
        ]
    },
    {
        "id": "1glmrma",
        "title": "Urgent help regarding Fr*nch",
        "content": "Hi I am currently at work and some Fr\\*nch lady send me this:\n\n**PAS D'AUTRE CDE**\n\nas a reason of a truck being late.\n\nDoes anyone have any idea what the fuck does this mean?\n\n(mods pls don't remove this post I have no further hope other than reddit since this woman isn't responding)",
        "subreddit": "logistics",
        "author": "Lewy_d00psko",
        "upvotes": 0,
        "created_at": "2024-11-07T09:39:29+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1glmrma/urgent_help_regarding_frnch/",
        "comments": [
            {
                "author": "Krescentia",
                "content": "..why is this word censored.. o.O",
                "upvotes": 11,
                "created_at": "2024-11-07T11:52:07+00:00"
            },
            {
                "author": "rasner724",
                "content": "They don’t have your BOL!! No order, aka no delivery order, they don’t know what to load",
                "upvotes": 4,
                "created_at": "2024-11-07T12:26:46+00:00"
            },
            {
                "author": "omimonki",
                "content": "CDE usually stands for \"commande\", which means \"order\".\n\nSo, \"no other order\" or \"no more orders\"",
                "upvotes": 2,
                "created_at": "2024-11-07T09:49:44+00:00"
            },
            {
                "author": "Eastern_East_96",
                "content": "No BOL.",
                "upvotes": 1,
                "created_at": "2024-11-07T15:00:04+00:00"
            },
            {
                "author": "Interesting-Year2015",
                "content": "lmao why is 'Fr\\*nch' censored tho 😂 anyway, from what i understood it means 'no other order' or 'no other request.' basically, she’s saying there’s no other shipment or task involved. doesn't really explain the truck being late tho, so good luck getting more info from her.",
                "upvotes": 1,
                "created_at": "2024-11-18T08:46:17+00:00"
            }
        ]
    },
    {
        "id": "1gle2cg",
        "title": "Distributing Medication",
        "content": "",
        "subreddit": "logistics",
        "author": "charlesholmes1",
        "upvotes": 2,
        "created_at": "2024-11-07T00:45:12+00:00",
        "url": "/r/LogisticsHub/comments/1gjtlvo/distributing_medication/",
        "comments": [
            {
                "author": "Ok-Baseball-4520",
                "content": "Please DM info! 3PL here, always looking for freight.",
                "upvotes": 1,
                "created_at": "2024-11-07T19:14:42+00:00"
            },
            {
                "author": "Interesting-Year2015",
                "content": "good luck sorting through all the DMs for this one lol. but yeah, make sure they know what they're doing with sensitive products and can handle DTC at scale. i’ve never shipped meds before ngl, but i use docshipper for my business and it’s been solid so far (almost 9 months working with them)",
                "upvotes": 1,
                "created_at": "2024-11-18T08:55:39+00:00"
            }
        ]
    },
    {
        "id": "1glb3cr",
        "title": "What roles should I look at with my experience as a logistics coordinator for four years at one company? What training should I work on to find a job in the next couple of years?",
        "content": "I've been at my current job for seven years and been in the logistics role since 2020. All of my training was done in a month and all additional \"training\" has been done by myself finding free seminars and such. The company I work for has been doing worse and worse due to declining sales and issues getting materials. Plus, they refuse to pay for an ongoing training.\n\nSo, I'd like to start looking and training for a new job. Would prefer remote but willing to move to a blue state for a job (currently live in a deep red one). I'm making $51,000 in my current role.\n\nMy duties include:\n\n* Importing containers of finished goods from Central America (filling out ISFs for broker, coordinating with warehouse and 3PL for delivery)\n* Exporting containers of materials to Central America (making bookings, creating MBOLs and Commercial Invoices, filing the EEIs on the Automated Export System (AES), providing all paperwork to the 3PLs we use)\n* Coordinating with freight companies to get our air shipments picked up quickly and delivered on time to customers\n* Ensure we are following all rules/regulations for C-TPAT compliance\n\nI've saved my company thousands of dollars by changing what companies we use and how we move our goods/materials. I've made actual SOPs instead of the handful of handwritten scribbles I was given by the person who trained me. Convinced our company to get our shippers HAZMAT certified because the one person in our company who was HAZMAT certified had quit.\n\nSo, I've got some experience but I'm not sure what roles I should look for or work on training for. I doubt I'd be good at sales (have never been in a sales position). Since I've only been at one company with little training (outside of what free seminars I've found online), I don't really know what my chances are against people with degrees or multiple roles. I'm not looking to make bank, just be comfortable.",
        "subreddit": "logistics",
        "author": "Gaelfling",
        "upvotes": 6,
        "created_at": "2024-11-06T22:29:38+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1glb3cr/what_roles_should_i_look_at_with_my_experience_as/",
        "comments": [
            {
                "author": "Status-Accountant-94",
                "content": "You have a strong foundation in logistics coordination, compliance, and cost-saving initiatives. Given your experience, consider roles like *Logistics Manager*, *Import/Export Specialist*, or *Supply Chain Analyst*. Since you're interested in remote work, these roles are commonly available in industries with distributed teams.",
                "upvotes": 2,
                "created_at": "2024-11-07T11:19:59+00:00"
            },
            {
                "author": "chrislovzlife",
                "content": "Remote jobs aren’t a real thing in logistics right now unless you work for a shipper but you probably won’t even make $51k at a shipper more like $17 hr \n\nSales at 3PL can be remote but be prepared to work your face off and get told no 500k times a day and you have to be really accountable and self motivated. Starting salary for sales role probably $45k if you’re lucky with OTE at 80k first year (so they say) will probably take you longer than a year to land any decent customers",
                "upvotes": 2,
                "created_at": "2024-11-07T21:55:17+00:00"
            },
            {
                "author": "fishingandstuff",
                "content": "Here’s what ChatGPT thinks: With four years of logistics experience in your current role, there are solid opportunities in both advanced logistics and operations positions. Here are some potential roles and recommended training:\n\nSuggested Roles\n\n\t1.\tLogistics Analyst or Supply Chain Analyst\nYour experience with import/export, cost-saving, and SOP creation is directly relevant. Analysts often support data-driven improvements, helping companies optimize their supply chain and cut costs.\n\t2.\tImport/Export Compliance Specialist\nMany companies seek specialists familiar with ISFs, AES filings, C-TPAT, and hazardous materials. This role leverages your compliance knowledge and could allow you to expand into trade compliance.\n\t3.\tOperations Coordinator/Operations Specialist\nOften similar to logistics but with broader focus on day-to-day operations, process improvements, and cross-departmental coordination.\n\t4.\tLogistics Manager or Supply Chain Coordinator\nIf you’re interested in management, these roles would allow you to use your SOP creation and coordination experience to lead a team or manage a segment of a larger supply chain.\n\nRecommended Training\n\n\t1.\tC-TPAT Certification & Export Compliance Training\nCourses in compliance will reinforce your understanding of regulations and could make you a more competitive candidate for roles emphasizing safety and compliance.\n\t2.\tFreight Forwarding and Customs Brokerage Training\nGaining more advanced knowledge in freight forwarding and customs brokerage (even if you won’t be performing these roles) can broaden your logistics skill set.\n\t3.\tData Analytics in Logistics\nConsider a course in data analytics (e.g., Excel, Power BI, or Python for data analysis) to give you a competitive edge for analyst roles, helping you better track and report on logistics KPIs.\n\t4.\tProject Management Certification (PMP or CAPM)\nProject management can strengthen your ability to coordinate complex logistics operations. Even a basic certification can be beneficial.\n\nGeneral Tips\n\n\t•\tHighlight Your Savings and Efficiency Contributions on your resume, as they are valuable to companies looking to improve margins and streamline processes.\n\t•\tNetwork in Logistics Communities online or through free webinars. Engaging in forums and attending webinars can help you find job leads and keep up with industry trends.\n\nStarting with these roles and training can help you build a solid foundation for advancing in logistics or pivoting to a related area.",
                "upvotes": 1,
                "created_at": "2024-11-11T12:36:12+00:00"
            }
        ]
    },
    {
        "id": "1gl827c",
        "title": "Startup 3PL WMS Solution - Excel?",
        "content": "Hello,\n\nI am in the process of planning a 3PL warehouse with a focus on FBA prep and order fulfillment (FBM, shopify, and so forth).\n\nI have spent too much time looking for a WMS that is both affordable and functional. I feel like a large number of WMS companies are just private labeled software lol.\n\nI am in the planning phase with my partners and this might not even go through, but I wanted to find a WMS to help us build an accurate budget.\n\nI know Excel is very mind-numbing and extremely inefficient, but I think it would be the best option to start for us because of the low cost.\n\nI would of course want to upgrade to something much more efficient/effective in due time based on order volume.\n\nThe warehouses we have been looking at is around 2800 sq ft. We don't know what our volume will be. And I am going to assume we'd have 3-5 people working (mostly family and friends to start lol).\n\nDoes anyone have suggestions or input?",
        "subreddit": "logistics",
        "author": "Super-Style482",
        "upvotes": 12,
        "created_at": "2024-11-06T20:20:58+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gl827c/startup_3pl_wms_solution_excel/",
        "comments": [
            {
                "author": "barrettshepherdsimpl",
                "content": "I've run a 3PL for the last 8 years, so I can share our journey with warehouse management systems. Starting out, I'd recommend using ShipStation or similar solutions over Excel as your basic foundation.\n\nIn our early days, we used SkuLabs until we outgrew it. We then switched to SHero, which we've been using for the past 6 years. While SHero is comprehensive, it isn't cheap, so I'd hesitate to recommend it to someone just starting a 3PL.\n\nCurrently, we're exploring alternatives to SHero for various reasons (happy to discuss privately). Some options we've looked into include:\n\n* Warehance: A really solid and more affordable solution started by my friend who also used to use SHero\n* Packiyo: Created by an ex-SHero founder, seems fairly solid but lacked some features we needed\n* Logiwa: Another established option in the space\n\nWe've been moving over to Warehance and it's been working out really well for us. In this industry, you'll likely end up using one of the major players like SHero, Logiwa, or similar solutions as you grow.",
                "upvotes": 5,
                "created_at": "2024-11-06T20:45:20+00:00"
            },
            {
                "author": "palletized",
                "content": "Hey. \n\nI work with various 3PL clients that are primarily doing FBA prep. I really like Hopstack for the FBA part simply because the depth I have seen them go into with their Amazon flows. Dealing with Amazon is really tricky as everyone knows, and I have gone through switching many softwares before settling on Hopstack. Most importantly the customer service is awesome which is what you want from your WMS provider:\n\nHowever, I see that a lot of new merchants are also getting into starting prep businesses or starter 3PL businesses like yourself. Hopstacks main platform is prolly an overkill. So they have another product that was launched a while ago called Ignite that focusses on starter businesses. I’ll highly recommend that. The alternatives that I have tried like scanpower, prepshiphub haven’t been that great for my clients.\n\nYou can also stitch something together with excel and airtable, but the effort involved might not be worth your time. So I suggest keeping 200-300$ as a monthly budget for the software.",
                "upvotes": 2,
                "created_at": "2024-11-07T06:29:54+00:00"
            },
            {
                "author": "delivergreat",
                "content": "Check out Packiyo, its a perfect solution for a 3PL or brand that is either just starting out or looking to get out an expensive and complicated solution. The platform is super intuitive, yet scalable.",
                "upvotes": 2,
                "created_at": "2024-11-07T12:30:28+00:00"
            },
            {
                "author": "mlopez1120",
                "content": "You're right on the fact that most WMS's started as spinoffs created by 3PL's. What you'll need is a platform that can connect with most of the retailers/distributors you'll be working with: Amazon, Walmart, Best Buy, Costco, Netsuite, Shopify, WooCommerce, etc... \n\nMake sure you get a WMS that helps you with integrating with most of the providers mentioned above as you never know where your journey may take you. Here's what I use: item(dot)com",
                "upvotes": 1,
                "created_at": "2024-11-06T20:28:52+00:00"
            },
            {
                "author": "Tomlambro",
                "content": "Lookup free online solutions ? Very basic WMS organise inbound / outbound operations and trace stock movements.\n\nThat's the minimum.\n\nExcel is ok to look at stock positions, or current level of stock, but is ill equipped to register all the operations that happen.",
                "upvotes": 1,
                "created_at": "2024-11-06T20:55:16+00:00"
            }
        ]
    },
    {
        "id": "1gl6wnw",
        "title": "General Rule of Thumb for Section 301 Tariffs and Quotas",
        "content": "\\*If it can be sourced in the USA section 301 tariffs are going to be extended or renewed. \n\n\\*If it's a commodity (agriculture and petro) keep an eye on quotas. \n\n",
        "subreddit": "logistics",
        "author": "mlopez1120",
        "upvotes": 3,
        "created_at": "2024-11-06T19:33:18+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gl6wnw/general_rule_of_thumb_for_section_301_tariffs_and/",
        "comments": []
    },
    {
        "id": "1gl41ck",
        "title": "Looking to acquire a New Jersey 3PL",
        "content": "Hi everyone,\n\n  \nI'm in the logistics space, and I'm looking to acquire a 3PL close to the ports of New Jersey. Requirements: \n\n* **Warehouse:** Must be above 100k sq ft. The ceiling must be above 21'\n* **Location**: New Jersey, less than an hour's drive from the ports. \n\nSend me a DM if you have something. ",
        "subreddit": "logistics",
        "author": "charlesholmes1",
        "upvotes": 3,
        "created_at": "2024-11-06T17:33:30+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gl41ck/looking_to_acquire_a_new_jersey_3pl/",
        "comments": [
            {
                "author": "akidinrainbows",
                "content": "The way this is written, I thought he was looking buy a company.  lol",
                "upvotes": 2,
                "created_at": "2024-11-07T03:58:26+00:00"
            },
            {
                "author": "WolverinePrimary1802",
                "content": "I am your guy",
                "upvotes": 1,
                "created_at": "2024-11-06T17:45:46+00:00"
            },
            {
                "author": "Interesting_Bit_7950",
                "content": "Let’s talk",
                "upvotes": 1,
                "created_at": "2024-11-06T19:20:48+00:00"
            },
            {
                "author": "Ok-Baseball-4520",
                "content": "Hello, this sounds perfect for our 3PL.  Please DM with info.",
                "upvotes": 1,
                "created_at": "2024-11-07T19:17:13+00:00"
            }
        ]
    },
    {
        "id": "1gkzife",
        "title": "Anyone concerned for their jobs?",
        "content": "Title says it all. As someone who works in international ocean shipping mainly from China to the US, I am concerned that if Trump imposes higher tariffs, my company won’t be able to sustain itself and I will lose my job. Anyone feeling the same? ",
        "subreddit": "logistics",
        "author": "BreakfastAlone983",
        "upvotes": 45,
        "created_at": "2024-11-06T14:17:14+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gkzife/anyone_concerned_for_their_jobs/",
        "comments": [
            {
                "author": "Ten-4RubberDucky",
                "content": "The products will still be needed.  I don't foresee your job going anywhere.",
                "upvotes": 29,
                "created_at": "2024-11-06T14:54:33+00:00"
            },
            {
                "author": "Dasheek",
                "content": "Only worry I have is if China gets swinging for real against Taiwan all surrounding countries won’t be able to ship out stuff from their factories. 90% of stock in my warehouse is made somewhere over there. So if Trump’s government gets sheepishly with Taiwan/China it is gonna get ugly for very long. ",
                "upvotes": 9,
                "created_at": "2024-11-06T16:17:16+00:00"
            },
            {
                "author": "FrenchFryMonster06",
                "content": "If you want to worry about losing an international shipping job this would be a better reason to worry than Trump. [https://www.supplychaindive.com/news/nearshoring-supply-chain-shift/729994/](https://www.supplychaindive.com/news/nearshoring-supply-chain-shift/729994/)",
                "upvotes": 8,
                "created_at": "2024-11-06T15:44:07+00:00"
            },
            {
                "author": "CosmoSourcing",
                "content": "I'm not concerned I'll lose it, but I do know I need to adapt and be flexible in the future",
                "upvotes": 8,
                "created_at": "2024-11-06T16:14:52+00:00"
            },
            {
                "author": "lukerobi",
                "content": "Mexico is going to be the reason you lose your job, not Trump.  Mexico is faster, more sustainable, and doesn't come with the cultural fun of dealing with China.",
                "upvotes": 9,
                "created_at": "2024-11-06T16:11:06+00:00"
            }
        ]
    },
    {
        "id": "1gjj17s",
        "title": "Advice on certifications",
        "content": "Currently pursuing Masters in logistics and supply chain management in Germany. However, my bachelors was in mechanical engineering and do not have much to show on resume regarding scm. Kindly suggest something such as courses, certification or some software skills that gives validation and assurance to employer regarding my field for part time student jobs. Knowledge is not a problem (I can study for those!) but the money is. I want to spend as little as possible on them since I am an international student. \n\nP.S - English isn't my first language.",
        "subreddit": "logistics",
        "author": "jeetshah1234",
        "upvotes": 5,
        "created_at": "2024-11-04T16:53:54+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gjj17s/advice_on_certifications/",
        "comments": [
            {
                "author": "scmsteve",
                "content": "There’s lots to choose from and the concept of cheap being less quality is applicable here. A no name certification may not help you too much. Your best bet would be to take a more entry level job and start getting some experience and try to move up quickly. Some people do internships, but I have never done so I couldn’t be much help there. Even an APICs certification alone may not help you much without any experience whatsoever. Good luck",
                "upvotes": 4,
                "created_at": "2024-11-04T23:09:29+00:00"
            },
            {
                "author": "mattdamonsleftnut",
                "content": "Easiest would be excel certification. I use excel for almost everything. I’m also seeing a lot of power bi cert in resumes as well.",
                "upvotes": 3,
                "created_at": "2024-11-05T23:41:45+00:00"
            },
            {
                "author": "Something_random_5",
                "content": "Go for anything planning related like Coursera has some good courses on supply chain and logistics.",
                "upvotes": 2,
                "created_at": "2024-11-05T22:14:14+00:00"
            },
            {
                "author": "Status-Accountant-94",
                "content": "You can start by taking advantage of free or affordable online resources. Platforms like Coursera, edX, and LinkedIn Learning offer free courses in logistics, supply chain management, and relevant software like Excel, SAP, or basic ERP systems. The APICS Fundamentals of Supply Chain Management is a good, budget-friendly certification. You could also explore Google Analytics or Microsoft Power BI for data management skills. These will enhance your resume and make you stand out without spending too much!",
                "upvotes": 2,
                "created_at": "2024-11-07T12:17:44+00:00"
            },
            {
                "author": "Interesting-Year2015",
                "content": "Try Coursera or edX for supply chain basics (many have free versions and coursera even have a financial aid program that can give you up to 90% off), or look into APICS/ASCM certifications like CPIM or CSCP – they’re gold standards, but a bit pricey unless you can get a student discount. for software, learn Excel inside out (pivot tables, VLOOKUPs, etc.) and maybe basics of SAP or Tableau – tons of free tutorials online. also, check LinkedIn Learning; they often have free trials. good luck, you’ve got this!",
                "upvotes": 2,
                "created_at": "2024-11-18T09:01:20+00:00"
            }
        ]
    },
    {
        "id": "1gjdfmz",
        "title": "ICC 1963 and ICC 1982",
        "content": "What are the differences? What led to the development of ICC 1982? I'm currently studying in suply chain management and having a difficult time finding between ICC 1963 and ICC 1982. Sorry for bad English ",
        "subreddit": "logistics",
        "author": "Intelligent-King435",
        "upvotes": 1,
        "created_at": "2024-11-04T12:49:33+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gjdfmz/icc_1963_and_icc_1982/",
        "comments": [
            {
                "author": "AutoModerator",
                "content": "This post was made by /u/Intelligent-King435 whom does not meet the the minimum karma requirement that is readily available in this subreddit rules. This rule exists to encourage posters to be users whom contribute to the subreddit in the comments before posting to everyone in this subreddit. Please participate before posting.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/logistics) if you have any questions or concerns.*",
                "upvotes": 1,
                "created_at": "2024-11-04T12:49:33+00:00"
            }
        ]
    },
    {
        "id": "1gj23xb",
        "title": "Carrier Procurement role at RXO",
        "content": "\nCould anyone give me insight on RXO or carrier procurement? I am in the Dallas-Ft. Worth area and have worked operation roles that worked with logistics but never a logistics company itself. \n\nI’m a senior at UNT doing Operations and Supply Chain but am open to this role.. I know logistics in general has its ups and downs but I always love a challenge. I’ve always been in full time roles in customer service since 2018 so that is not a new challenge and work with a trailer leasing company so have familiarity with aspects of the industry. \n\nThank you for any insight ",
        "subreddit": "logistics",
        "author": "dannykdjr",
        "upvotes": 5,
        "created_at": "2024-11-04T00:47:43+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gj23xb/carrier_procurement_role_at_rxo/",
        "comments": [
            {
                "author": "Ok_Weight2463",
                "content": "Carrier procurement now a days is  more about knowing what to look for to spot scams before assigning the carrier to a load.  It’s a broker’s market right now so carriers will call in trying to book the load that’s posted; you have to spot the good carriers while weeding out the fake ones. There was a time where the role would pound the phone to reach out to carriers to do the load.",
                "upvotes": 6,
                "created_at": "2024-11-04T01:55:15+00:00"
            },
            {
                "author": "Suitable-Scholar-778",
                "content": "When  the market flips, you'll need to be a good salesperson to find a truck",
                "upvotes": 2,
                "created_at": "2024-11-04T02:40:12+00:00"
            },
            {
                "author": "Status-Accountant-94",
                "content": "RXO is a solid choice, especially for someone with your background in operations, customer service, and trailer leasing. Carrier procurement involves building relationships with carriers, negotiating rates, and ensuring capacity, which aligns well with logistics and supply chain management. RXO is a spinoff from XPO, which has a strong reputation in the logistics industry, and Dallas-Ft. Worth is a major hub, so you’d likely get valuable experience.",
                "upvotes": 2,
                "created_at": "2024-11-04T10:32:57+00:00"
            },
            {
                "author": "kg100021",
                "content": "Be careful as RXO is known to be pretty cut throat and have no problem firing employees for the smallest of reasons. \nMake sure you like your manager and know what’s expected of you",
                "upvotes": 1,
                "created_at": "2024-11-04T22:19:39+00:00"
            },
            {
                "author": "FilthyLikeGorgeous",
                "content": "RXO is a good company to get your foot in the door with, I would recommend pursuing an opportunity with them. Great name brand, you will have solid exit opportunities within supply chain & logistics.",
                "upvotes": 1,
                "created_at": "2024-11-05T21:31:39+00:00"
            }
        ]
    },
    {
        "id": "1git0c8",
        "title": "Where can I go with my exp?",
        "content": "I was a bartender for about 9 years, a call center rep for a little over 3.5 years, and I've been a sales coordinator for about 3 months. I don't know where else to do, but I do know that I don't want to work these job for the rest of my life. Hell, I doubt these jobs will even be around in 10 years. In my current role, I handle incoming stocks, use SAP for order management, communicate with warehouse and customers, and also with our overseas team.  \n\nI only have an associates degree, and the only software I've used for work were MS Office Suite and SAP for order processing and data entry. Since I work closely with warehouse, customers, and sales people, are there any jobs I can move up in?\n\nI don't make much at the moment, so is it possible to move into something that pays more than 45K? ",
        "subreddit": "logistics",
        "author": "Pure_Zucchini_Rage",
        "upvotes": 4,
        "created_at": "2024-11-03T18:03:52+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1git0c8/where_can_i_go_with_my_exp/",
        "comments": [
            {
                "author": "Jeuro007",
                "content": "The great thing about Supply Chain /  Logistics is a 4 year degree is not 100% “Gold” because the industry moves very fast you should look at getting a Cert from APICS and this will give you a gauge of where you might want to take your career.",
                "upvotes": 5,
                "created_at": "2024-11-03T19:29:48+00:00"
            },
            {
                "author": "scmsteve",
                "content": "How long have you been doing this?what does your company do? Manufacturing?",
                "upvotes": 1,
                "created_at": "2024-11-03T19:22:54+00:00"
            },
            {
                "author": "cobaltscar",
                "content": "SAP is a pretty popular ERP for distribution companies. Maybe try to leverage that in order to get into a coordinator position. Once you get experience and connection within the company start applying internally.",
                "upvotes": 1,
                "created_at": "2024-11-04T00:00:11+00:00"
            },
            {
                "author": "ScottyR2287",
                "content": "In order to make more money in the logistic space generally speaking, you need to move up from the line level into supervision and or leadership roles, or some kind of specialty role, like inventory management or IT. The first step in terms of determining where to go, is to look at your set of skills. What do you enjoy most about the job? What do you consider key strengths of yours? If you have a strong attention detail and are good with numbers inventory or financial analysis would be good places to explore. If you’re a hard worker, dedicated and can show up every day, have good communication skills then looking to get into a lead role or management role would be something to consider. If you’re great at written communication, email, problem solving and friendly on the phone. Client services would be something to consider. Once you determine what you think would be the best fit. The next step would be to talk to someone that you get along with on your leadership team. Explain to them that you’re interested in career progression and you’re willing to put in the work. Tell them that you think you would be good at whatever mightier might be and ask for their help, in getting some exposure to different opportunities. Some logistics companies have some type of management training programs that you might be able to participate in.  Minimally you could volunteer to assist whoever the lead person might be to start to get a better feel for a particular role so that you can understand if it’s something you feel would be a good fit. When you can find something that you like, and that you’re good at then work becomes a lot easier, and your career progression will be faster. All of these will pay you more than 45k a year and as you move up in higher management roles,, you could make 100K or more. Keep in mind that the trade-off for more money is always harder work in many cases longer hours and in almost all cases higher levels of responsibility that come with more pressure. That’s just the trade-off in this business for higher wages.",
                "upvotes": 1,
                "created_at": "2024-11-04T13:46:30+00:00"
            }
        ]
    },
    {
        "id": "1gir8h7",
        "title": "3.1CBM LCL load from INBOM1(Mumbai, india) to newyork, Please Help me figure out the cost",
        "content": "I will be sending handicrafts made of aluminium to Amazon's fulfillment warehouse in newyork. The goods weigh 410kg(900ish pounds) and the volumetric weight is 3.1cbm. Since its my first time shipping i cant figure out when should i have my goods ready by Mid December/early January. Will delaying it help me get better rates?\n\nI would be greatful if someone can help me figure out the approximate cost of shipping 3.1cbm from india to usa, dont know if i can rely on freightos rates",
        "subreddit": "logistics",
        "author": "SeoUrMum",
        "upvotes": 1,
        "created_at": "2024-11-03T16:48:11+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gir8h7/31cbm_lcl_load_from_inbom1mumbai_india_to_newyork/",
        "comments": [
            {
                "author": "Tlo928",
                "content": "Just sent you a DM.",
                "upvotes": 1,
                "created_at": "2024-11-03T17:34:47+00:00"
            },
            {
                "author": "blaccsnow9229",
                "content": "CFS-CFS probably around 200/cube.",
                "upvotes": 1,
                "created_at": "2024-11-03T23:36:13+00:00"
            },
            {
                "author": "More-Actuator-1729",
                "content": "Late December to mid January will give you better rates. \n\nFreightOS and CogoPort are shit. \n\nIt’s best to contact 3/5 local freight forwarders and get quotes for shipping to NYC. \n\nSince this is FBA, Amazon will also have an option to quote for freight via their own recommended carriers.",
                "upvotes": 1,
                "created_at": "2024-11-04T02:42:53+00:00"
            }
        ]
    },
    {
        "id": "1giiz2u",
        "title": "Freelance Analyst Available – Data Insights to Optimize Your Supply Chain and Reduce Costs",
        "content": "Hi everyone! 👋\n\nI’m a freelance data analyst specializing in logistics and supply chain optimization. If you’re looking to streamline your operations, cut down costs, or improve delivery efficiency, I can help turn your logistics data into actionable insights.\n\n**Here’s How I Can Help:**\n\n* **Inventory Optimization**: Identify optimal stock levels to avoid overstocking or stockouts, ensuring smooth operations and cost savings.\n* **Demand Forecasting**: Use historical data to predict demand patterns, helping you allocate resources effectively and prevent wastage.\n* **Route Optimization**: Analyze and optimize delivery routes to reduce fuel costs, travel time, and improve delivery efficiency.\n* **Cost Analysis & Reduction**: Pinpoint areas where you might be overspending in logistics, from warehousing to transport, and suggest data-backed ways to cut costs.\n* **Fleet Management Insights**: Track and analyze fleet performance, from maintenance schedules to usage patterns, to increase efficiency and reduce downtime.\n* **Real-Time Tracking & Alerts Setup**: Set up data-driven alerts and dashboards that monitor logistics KPIs in real-time for faster decision-making.\n\n**How It Works**: We start with a free consultation where I get to know your business, challenges, and goals. After a thorough data analysis, I provide an actionable plan tailored to your unique needs, and I can work with your team on an ongoing basis to track progress and adjust as necessary.\n\n**Interested?**  \nFeel free to DM me or reply here if you’re curious about how data analytics can make a difference in your logistics operations! I’d be happy to discuss.\n\nLet’s turn your logistics data into your competitive advantage! 🚛📊",
        "subreddit": "logistics",
        "author": "mutheu-DataAnalyst",
        "upvotes": 1,
        "created_at": "2024-11-03T09:16:58+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1giiz2u/freelance_analyst_available_data_insights_to/",
        "comments": [
            {
                "author": "Snoop_Doge007",
                "content": "What kind of analysis do you rely on for cost optimization/reduction?",
                "upvotes": 1,
                "created_at": "2024-11-08T05:37:35+00:00"
            }
        ]
    },
    {
        "id": "1gih203",
        "title": "Please help me to get my parcel",
        "content": "Parcel didn’t delivered ",
        "subreddit": "logistics",
        "author": "Saffu91",
        "upvotes": 0,
        "created_at": "2024-11-03T06:46:34+00:00",
        "url": "https://i.redd.it/3vwmd282vmyd1.jpeg",
        "comments": [
            {
                "author": "iolitm",
                "content": "HAHHAHAHAHABABAB\n\ngood luck bro",
                "upvotes": 5,
                "created_at": "2024-11-03T07:12:43+00:00"
            },
            {
                "author": "ButWereFriends",
                "content": "Ok what are you actually expecting from us?",
                "upvotes": 2,
                "created_at": "2024-11-03T19:41:13+00:00"
            },
            {
                "author": "alytore",
                "content": "I have some bad news bro…",
                "upvotes": 1,
                "created_at": "2024-11-04T00:53:01+00:00"
            }
        ]
    },
    {
        "id": "1ghrmak",
        "title": "logistics of resolving gridlock",
        "content": "hi I am interested what strategies organizations have used to resolve gridlock situations. My usual method for research has come up dry to answer this so if anyone could lead me to what methods are used when a traffic gridlock occurs I would be most thankful. ",
        "subreddit": "logistics",
        "author": "SeeYouSpaceCow",
        "upvotes": 2,
        "created_at": "2024-11-02T08:01:35+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1ghrmak/logistics_of_resolving_gridlock/",
        "comments": [
            {
                "author": "mattdamonsleftnut",
                "content": "Google maps",
                "upvotes": 2,
                "created_at": "2024-11-02T16:39:34+00:00"
            },
            {
                "author": "Status-Accountant-94",
                "content": "Resolving gridlock typically involves a combination of immediate traffic management and long-term planning. For immediate action, organizations deploy adaptive traffic signals, reroute traffic, and use live updates for drivers. Advanced technologies like AI-driven traffic cameras can detect bottlenecks and adjust traffic light patterns in real time. Long-term solutions include building alternate routes, improving public transit, and promoting staggered work hours to reduce peak traffic. Some cities also use congestion pricing, which charges drivers to enter high-traffic zones. A mix of these strategies has proven effective in minimizing gridlock and keeping traffic flowing.",
                "upvotes": 2,
                "created_at": "2024-11-04T10:34:42+00:00"
            },
            {
                "author": "scmsteve",
                "content": "Traffic gridlock and supply chain? You think they are related?",
                "upvotes": 1,
                "created_at": "2024-11-02T23:28:18+00:00"
            }
        ]
    },
    {
        "id": "1ghhs3m",
        "title": "Correct Method for Transporting Manure?",
        "content": "Shouldn't this be in an enclosed dump trailer?",
        "subreddit": "logistics",
        "author": "offthewallds",
        "upvotes": 74,
        "created_at": "2024-11-01T22:31:04+00:00",
        "url": "https://i.redd.it/hbfjjc4r9dyd1.jpeg",
        "comments": [
            {
                "author": "CarolinaCajun100",
                "content": "Take my upvote ",
                "upvotes": 8,
                "created_at": "2024-11-02T12:51:11+00:00"
            },
            {
                "author": "KILLBILL_-_",
                "content": "where are they dumping this bs",
                "upvotes": 1,
                "created_at": "2024-11-02T21:28:32+00:00"
            },
            {
                "author": "CRST-International",
                "content": "This looks like a truck sim picture with the assets not loading all the way, LOL!",
                "upvotes": 1,
                "created_at": "2024-11-05T16:31:36+00:00"
            },
            {
                "author": "mattdamonsleftnut",
                "content": "I don’t get the hate for teslas",
                "upvotes": 3,
                "created_at": "2024-11-01T22:53:06+00:00"
            },
            {
                "author": "1nda",
                "content": "Better hope he doesn’t pass a weigh station lol",
                "upvotes": 1,
                "created_at": "2024-11-02T01:29:00+00:00"
            }
        ]
    },
    {
        "id": "1ghdnw8",
        "title": "Discuss with supervisors for a project",
        "content": "Hello,\n\nI'm conducting a project in my college course about supervision. I was wondering if there are any supervisors who wouldn't mind having a discussion online sometime to answer and discuss about 10 questions that I have(not a call, but a chat, so I can track everything we discuss). \n\nI'm looking for a few supervisors, one with 5+ years of experience as a supervisor, and one with no more than two years of experience. \n\nI am working towards my Associates degree in logistics and supply chain management, so I thought I would ask some supervisors who work in this field. \n\n(Will include getting to know your name, company, contact information.)\n\nThank you. ",
        "subreddit": "logistics",
        "author": "Ordinary-Warning-831",
        "upvotes": 1,
        "created_at": "2024-11-01T19:26:33+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1ghdnw8/discuss_with_supervisors_for_a_project/",
        "comments": []
    },
    {
        "id": "1ghdks8",
        "title": "Anyone having issues with excessive exams for containers going through Gulfport?",
        "content": "Of the last ten containers we have shipped into the US through Gulfport, nine have been picked for X-ray or agricultural exams. That is more than we had in all of 2023 or 2022. It is only an issue for containers going through Gulfport. We sent a couple through Jacksonville because of the strike and they were fine. \n\nWe are CTPAT Level III certified if that makes a difference. These are containers coming from Central America to the US and we've been using this route for over a decade with no issues.",
        "subreddit": "logistics",
        "author": "Gaelfling",
        "upvotes": 1,
        "created_at": "2024-11-01T19:22:44+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1ghdks8/anyone_having_issues_with_excessive_exams_for/",
        "comments": [
            {
                "author": "DeliveryDesperate643",
                "content": "Sometimes CBP will flag certain importers or suppliers.",
                "upvotes": 1,
                "created_at": "2024-11-01T23:31:33+00:00"
            },
            {
                "author": "Status-Accountant-94",
                "content": "It sounds frustrating to face such high inspection rates, especially when you’re CTPAT Level III certified. Gulfport might be experiencing heightened scrutiny right now, possibly due to recent events or security concerns specific to that port. It could also be related to CBP's risk assessment algorithms.",
                "upvotes": 1,
                "created_at": "2024-11-07T12:06:16+00:00"
            },
            {
                "author": "Watch_me_logisitc",
                "content": "CBP tends to go bananas with exams in November and December. It must be some kind of a quota they have to fill by the end of the year. Were a customs broker. Good half of our imports are getting examined. LA/LB is particularly rough.",
                "upvotes": 1,
                "created_at": "2024-11-09T02:21:55+00:00"
            }
        ]
    },
    {
        "id": "1ghaouh",
        "title": "How do shippers book LTL?",
        "content": "I’m a veteran of the LTL industry and work for a major retailer. I’ve experienced orders coming into my dispatch systems but have never really thought about the means and mechanisms that shippers-themselves use to trigger orders. My current retailer has custom software that gives us a direct line to the carriers system. Wondering how different businesses/shippers do it though? Whether there are different software products for this kind of thing and which are the most popular? Whether they operate through brokers and what sort of details and methods they use to convey their info? Whether they just call the carrier?\n\n\nOpen to a diversity of experiences. Wanting to understand the industry a bit more holistically. ",
        "subreddit": "logistics",
        "author": "dominodd13",
        "upvotes": 9,
        "created_at": "2024-11-01T17:18:49+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1ghaouh/how_do_shippers_book_ltl/",
        "comments": [
            {
                "author": "Anonymous",
                "content": "[deleted]",
                "upvotes": 4,
                "created_at": "2024-11-01T18:02:52+00:00"
            },
            {
                "author": "Fragrant_Click8136",
                "content": "First I like the name Domino D13 … \n\nIt’s seems like you’re using a TMS provided by the retailer- thus the TMS is linked via EDI/ API to the carriers inbound portal’s dispatch \n\nFirst you have to have a mechanism to create your own BOLs aka order shipping. Second; depending upon the volume of shipments/bols u can simply connect with the LTL carrier on their online portal and schedule the pickups. \n\nThe pickup order and the bol creations are two separate functions:)\n\n\nEach carrier has their own portal - The TMS is able to have multiple carriers in one single portal :)",
                "upvotes": 4,
                "created_at": "2024-11-01T20:46:50+00:00"
            },
            {
                "author": "uberbeast",
                "content": "We have an integrated TMS that we use across multiple divisions.\n\nPart of our job in the Transportation group is ensuring carriers are setup (EDI or via API) so that all users can quote, book and ship with a click of a button either in the TMS or in their ERP/WMS. (Spot quotes are also supported)\n\nThe only time anyone is calling a carrier is if there is an exception to the process. This integration allows us to run thousands of shipments a day with a smaller staff than if we were booking everything manually.",
                "upvotes": 2,
                "created_at": "2024-11-03T12:36:48+00:00"
            },
            {
                "author": "Puzzleheaded_Law_882",
                "content": "I am a 3PL and we have negotiated rates that are lower then most shippers can get for themselves. We have a huge network of LTL carriers. Clients can either email us or use our portal and book themselves. \n\nI see in another thread you asked about tracking. We have an electronic connection with each carrier and also do manual update as well, so our portal is often more accurate than the carrier website because we sometimes talk directly to terminals and get updates from dispatch that aren't in the system yet.",
                "upvotes": 2,
                "created_at": "2024-11-01T22:44:51+00:00"
            },
            {
                "author": "ACupOfCheese",
                "content": "They can be setup directly with a carrier or they can use a 3pl like Echo or Globaltranz. This gives them access to their online system and tariffs and they can book on their platform.",
                "upvotes": 1,
                "created_at": "2024-11-01T17:25:12+00:00"
            }
        ]
    },
    {
        "id": "1ggxd2p",
        "title": "Sales Question",
        "content": "Hi folks, Im wondering as sales in freight forwarding how would u approach a cold call?   \nWhat should be asked and how? and  \nHow to start the conversation in a fluid manner yet addressing key questions?",
        "subreddit": "logistics",
        "author": "Pakistani_Timber_Mob",
        "upvotes": 3,
        "created_at": "2024-11-01T04:17:41+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1ggxd2p/sales_question/",
        "comments": [
            {
                "author": "Bearjupiter",
                "content": "Best advice would be to listen in on a cold call being done by a colleague good at their job",
                "upvotes": 2,
                "created_at": "2024-11-01T05:17:47+00:00"
            }
        ]
    },
    {
        "id": "1ggsjfk",
        "title": "Cbsa trade compliance",
        "content": "I was recently notified that there’s a Compliance Validation Case currently in progress for our company. The objective of this verification is to promote and ensure compliance with customs accounting obligations as they relate to the CBSA’s tariff classification program. \n\nIs there anything I should be concerned about? Our company is only 2 years old with our broker handling most of our imports. ",
        "subreddit": "logistics",
        "author": "Harrietstyles19",
        "upvotes": 1,
        "created_at": "2024-10-31T23:51:05+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1ggsjfk/cbsa_trade_compliance/",
        "comments": [
            {
                "author": "ggtyh2",
                "content": "The first thing to do now is to make sure you have ALL the documents for your imports. By law, you are required to have a copy of all the docs for the last 6 years. You might be asked to provide some date (proofs of payment, product samples, etc). CBSA will tell you what they want. If it's not clear, ask for clarification.\n\nCBSA will tell you what the problem is, if there's one. You may ask your custom broker to get involved (they may charge).\n\nCBSA's attitude is way more lenient than other countries. If it's your first audit and you made a mistake in good faith, you will get a small fine. You can even spend the amount of the fine in training and solutions to prevent the issue from occurring again.",
                "upvotes": 3,
                "created_at": "2024-11-01T00:33:20+00:00"
            }
        ]
    },
    {
        "id": "1ggl6ii",
        "title": "Warehouse Tracking for High School",
        "content": "As the Title states, work at a state ran High School and the boss's would like to start an iventory on everything we have on hand. Currently have one warehouse that has a range from Toilet Paper, Laundry soap to the kids uniforms they wear daily.\n\n  \nLooking for something that can track resupplies coming in as well as exchanges that i do for the kids on a weekly bases. We obviously are not selling anything if that plays a factor as well.",
        "subreddit": "logistics",
        "author": "carpkid805",
        "upvotes": 1,
        "created_at": "2024-10-31T18:17:09+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1ggl6ii/warehouse_tracking_for_high_school/",
        "comments": [
            {
                "author": "Street-Baseball8296",
                "content": "Quickbooks would work for what you’re looking for.",
                "upvotes": 3,
                "created_at": "2024-10-31T19:41:37+00:00"
            },
            {
                "author": "cobaltscar",
                "content": "Think you might be able to do this with a simple Excel sheet.",
                "upvotes": 2,
                "created_at": "2024-10-31T20:45:50+00:00"
            }
        ]
    },
    {
        "id": "1ggcc1b",
        "title": "Expect More Delays: Perfect Storm to Crunch Global Shipping in 2025",
        "content": "Huge volumes of shipping vessels are now “bunching” at ports and terminals, with global shipping lanes “out of whack” due to the Red Sea Crisis and problems with the Panama Canal. These add strain to an industry struggling with spiralling costs and a shortage of vessels.\n\nIt comes as Sea Intelligence reveals that “vessel bunching” – which is defined as the number of sailings in a given week that exceed scheduled services – has skyrocketed, especially between Northern Europe and Asia – responsible for more than 70% of the trade in bulk timber products.\n\n“While the offered capacity may be the same over two weeks, i.e., no vessel sailing in one week followed by two vessels sailing the next week, having two vessels depart in one week and zero vessels in the second week results in an extraordinarily high workload in one week and none in the second week,” according to Alan Murphy, CEO of Sea-Intelligence.",
        "subreddit": "logistics",
        "author": "ChangeNarrow5633",
        "upvotes": 6,
        "created_at": "2024-10-31T11:35:38+00:00",
        "url": "https://woodcentral.com.au/expect-more-delays-perfect-storm-to-crunch-global-shipping-in-2025/",
        "comments": [
            {
                "author": "wagsman",
                "content": "The two issues mentioned have been issues for a long time.  The Red Sea crisis with regard to piracy has been an issue for more than a year, and the multinational fleet guarding the shipping passage has been in place for 10 months.    The drought causing the issues with the Panama Canal has been an issue for 10 months as well.  \n\nThese problems have already been absorbed by the industry.  What additional issues are causing this bunching?",
                "upvotes": 5,
                "created_at": "2024-10-31T12:48:23+00:00"
            },
            {
                "author": "Suitable-Scholar-778",
                "content": "These are not new issues.  Over the long term the system will stabilize.",
                "upvotes": 1,
                "created_at": "2024-11-01T02:33:08+00:00"
            }
        ]
    },
    {
        "id": "1gg6xdx",
        "title": "What should I pay attention to in a Freight Forwarding Agreement contracts?",
        "content": "Hi guys, I am new to starting a small business and managing import logistics. We are sourcing packages from overseas and plan to be working with a local Chinese FF on Alibaba to consolidate and ship everything to Australia. \n\n\\- Is it safe to work with a FF on Alibaba?\n\n\\- They are quoting me $1.1 USD/ KG DDP Sea to Australia - is this a reasonable price?\n\n\\- What should I pay attention on an agreement contract to make sure they receive all my cartons correctly, do inspection and send out as we agreed on? I do not want it to be the case where the FF holds my goods and refuse to send them unless I agree to their increased price - which is the scenarios I have heard a lot on reddit here\n\n  \nThanks guys",
        "subreddit": "logistics",
        "author": "bondtradercu",
        "upvotes": 4,
        "created_at": "2024-10-31T05:00:16+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gg6xdx/what_should_i_pay_attention_to_in_a_freight/",
        "comments": [
            {
                "author": "Philip_Caps",
                "content": "As a freight forwarder in China,I can tell you for DDP sea shipping $1-2/kg is a normal shipping rate to Australia.\n\nIf your goods are over 5cbm and reseller business,I'd like to recommend to ship by DAP(DDU) shipping then you can claim GST back in Australia.",
                "upvotes": 1,
                "created_at": "2024-10-31T14:50:46+00:00"
            }
        ]
    },
    {
        "id": "1gfu96l",
        "title": "Dray Request - 20’ ISO",
        "content": "Please quote rail & OTR.\n\n20’ isotank S.O.C. similar to below\n\nLoading point: 07002 Bayonne (New Jersey)\n\nUnloading point: 95688 Vacaville (California)\n\nReturning empty Isotank in: 90802 Long Beach (California)\n\n44,093 lbs net (52911 lbs gross)\n\nHS CODE: 39072920",
        "subreddit": "logistics",
        "author": "xx_seif_xx",
        "upvotes": 1,
        "created_at": "2024-10-30T18:56:06+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gfu96l/dray_request_20_iso/",
        "comments": [
            {
                "author": "Maleficent-Theory908",
                "content": "20', liquid filled, overweight container across the United States? Ha. Popcorn ready. You must not like the rate from your provider?",
                "upvotes": 4,
                "created_at": "2024-10-30T18:59:15+00:00"
            },
            {
                "author": "Ok_Watercress_9165",
                "content": "If you think you can run an OW 20 isotank across the country with without giving us all relevant isotank info you are in for a world of hurt \n\nWon’t be worth it, I promise you",
                "upvotes": 4,
                "created_at": "2024-10-31T00:30:31+00:00"
            },
            {
                "author": "MuchCarry6439",
                "content": "$50K literally lol",
                "upvotes": 2,
                "created_at": "2024-10-30T20:10:32+00:00"
            },
            {
                "author": "Interesting_Bit_7950",
                "content": "Dm sent",
                "upvotes": 1,
                "created_at": "2024-10-30T19:13:38+00:00"
            },
            {
                "author": "hinasilica",
                "content": "LOL",
                "upvotes": 1,
                "created_at": "2024-10-31T18:11:23+00:00"
            }
        ]
    },
    {
        "id": "1gfkz4f",
        "title": "Can I ask for a survey @mods?",
        "content": "[https://tally.so/r/mOBjaR](https://tally.so/r/mOBjaR)  \n  \nPS - no email required",
        "subreddit": "logistics",
        "author": "unluckybitch18",
        "upvotes": 1,
        "created_at": "2024-10-30T12:09:58+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gfkz4f/can_i_ask_for_a_survey_mods/",
        "comments": [
            {
                "author": "scmsteve",
                "content": "For what purpose? Marketing?",
                "upvotes": 2,
                "created_at": "2024-10-30T13:10:51+00:00"
            },
            {
                "author": "scmsteve",
                "content": "Ok but me but I stopped at the “enter your email address” and I suspect many others will do the same.",
                "upvotes": 1,
                "created_at": "2024-10-30T15:36:24+00:00"
            }
        ]
    },
    {
        "id": "1gfes41",
        "title": "How to approach trade expos as a Logistics Service Provider representative?",
        "content": "Hi folks, will be attending an electronics manufacturer expo next month, need help on what I should be paying attention to, or soliciting from companies participating in the expo. I myself represent an LSP with warehouse and trucking capabilities  for sensitive electronic products.   \n  \nHow should I approach this to get business from the target companies? I'm aware that these companies are there to market what they sell, how can my service tie into this (as in terms of giving added value for their products)?",
        "subreddit": "logistics",
        "author": "Pakistani_Timber_Mob",
        "upvotes": 1,
        "created_at": "2024-10-30T04:45:58+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gfes41/how_to_approach_trade_expos_as_a_logistics/",
        "comments": [
            {
                "author": "wtfever3",
                "content": "bagaimana dengan unit misi khusus intel? apakah mereka merekrut dari kelompok yang berbeda/ atau apakah para kandidat dinilai berdasarkan persyaratan yang berbeda?",
                "upvotes": 1,
                "created_at": "2024-10-30T14:49:10+00:00"
            }
        ]
    },
    {
        "id": "1gfeh3y",
        "title": "Micro 3PL Search",
        "content": "Looking for options. Need a more personal Micro 3PL handling small, fragile high value items.  Willing to pay for extra care.  Small order volume, low temperature required ~70 degrees. Appreciate any leads.   Big box, large warehouse not needed.  All inventory can fit in a regular refrigerator.",
        "subreddit": "logistics",
        "author": "reguru2023",
        "upvotes": 4,
        "created_at": "2024-10-30T04:26:37+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gfeh3y/micro_3pl_search/",
        "comments": [
            {
                "author": "EmergencyExample1582",
                "content": "I own valley high logistics. We’re a small veteran owned business. Happy to discuss your needs. DM me.",
                "upvotes": 2,
                "created_at": "2024-11-04T02:10:52+00:00"
            },
            {
                "author": "Kind_Knee_5956",
                "content": "Hi, i have a 3PL company located in New Jersey. Shoot me a DM or you can also contact me through following email and phone.\nekirveli@krvlogistics.com\n773 923 8003",
                "upvotes": 2,
                "created_at": "2024-11-04T15:44:37+00:00"
            },
            {
                "author": "avocado_oil_fan",
                "content": "Warehut, hands down.",
                "upvotes": 1,
                "created_at": "2024-10-31T09:59:53+00:00"
            },
            {
                "author": "Aggravating_Pick_108",
                "content": "3pl owner here, DM me.",
                "upvotes": 1,
                "created_at": "2024-10-31T12:49:45+00:00"
            },
            {
                "author": "WolverinePrimary1802",
                "content": "i have these services available nation wide 24/7. ill be pming",
                "upvotes": 1,
                "created_at": "2024-10-31T14:33:49+00:00"
            }
        ]
    },
    {
        "id": "1gf9syu",
        "title": "Where are the best places to look for logistics jobs?",
        "content": "I have experience driving but am getting nowhere with it.  I've looked on indeed and ziprecruiter a bit but havent gotten any bites to applications I've sent in to other types of jobs in logistics quite yet.  Was wondering if there are any good places to look?  I want to advance my career a bit so I can make a bit more money.  Thanks",
        "subreddit": "logistics",
        "author": "Just_Amy_23",
        "upvotes": 14,
        "created_at": "2024-10-30T00:19:29+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gf9syu/where_are_the_best_places_to_look_for_logistics/",
        "comments": [
            {
                "author": "iolitm",
                "content": "\n\nFedEx\n\nUPS\n\nDHL\n\nMaerks\n\nKuehne + Nagel\n\nDSV\n\nCH Robinson\n\nExpeditors\n\nCEVA\n\nSchneider",
                "upvotes": 18,
                "created_at": "2024-10-30T01:46:53+00:00"
            },
            {
                "author": "hinasilica",
                "content": "I’m not sure I really have an answer for you, but what exactly are you trying to do in logistics?",
                "upvotes": 3,
                "created_at": "2024-10-30T00:45:10+00:00"
            },
            {
                "author": "OnAMission0806",
                "content": "Don’t just start looking for 3PL or logistics specific positions. Go to the actual logistics company websites and see what positions they are actually hiring for. \n\nFedex, Amazon, TForce, Old Dominion, SAIA, XPO/GXO, SEFL, Roadrunner, DHE",
                "upvotes": 3,
                "created_at": "2024-10-30T02:00:00+00:00"
            },
            {
                "author": "Drisgal",
                "content": "Tell us what area , and that will help point you to some companies .",
                "upvotes": 2,
                "created_at": "2024-10-30T18:49:11+00:00"
            },
            {
                "author": "WatchOutForDeer12",
                "content": "LinkedIn and only Linkedin",
                "upvotes": 2,
                "created_at": "2024-10-31T02:53:19+00:00"
            }
        ]
    },
    {
        "id": "1gew686",
        "title": "What tips do you have for successfully getting out of TL operations?",
        "content": "I am currently in an operations role in an asset based 3PL company. My day to day is essentially as a dispatcher for our drivers and am basically a one man show for our freight brokerage operations. Truthfully, I am burnt out of operations and the complete and utter chaos that comes with both being asset based and running a brokerage. Im not really supported at my current company in that they wont hire anyone to help as we expand and frankly ownership runs things like it is the 1980s. It is like pulling teeth to modernize. Admittedly, freight is not our bread and butter as we are a distributor who delivers our own product more than we are a trucking company and the trucking and brokerage side exist just to support our distribution operations, so i am a bit of an afterthought and am expected to just move everything on a whim when we need more trucks for our outbound. Its an interesting idea to employ enough drivers and still have flexibility when outbound is slow. Im not upset at it, its what I was brought here to do but truthfully I am just burnt out from putting out fires with customers and managing drivers. I think I could have success in TMS software sales or support, where I can still use my knowledge of transportation and not be involved in the day to day of shipments, but thats just a thought. \n\nAnyone successfully transition out of operations and into a logistics adjacent role? If so, what are you doing now and are you doing well financially? ",
        "subreddit": "logistics",
        "author": "Set_the_tone-",
        "upvotes": 5,
        "created_at": "2024-10-29T14:37:37+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gew686/what_tips_do_you_have_for_successfully_getting/",
        "comments": [
            {
                "author": "Worldly_Bid7386",
                "content": "I relate to you dude, I’m an account manager for a 3PL and I’ve been here for about 1 yr and 3 months. I’m burnt out, plain and simple",
                "upvotes": 2,
                "created_at": "2024-10-29T21:07:21+00:00"
            },
            {
                "author": "mattdamonsleftnut",
                "content": "What’s your title?",
                "upvotes": 1,
                "created_at": "2024-10-29T17:46:21+00:00"
            },
            {
                "author": "Unlikely-Author-9068",
                "content": "Any trucking company or brokerage will take you. But question what you want to be sales or ops?",
                "upvotes": 1,
                "created_at": "2024-10-30T21:10:48+00:00"
            }
        ]
    },
    {
        "id": "1gelrlr",
        "title": "What should I focus on learning if I want to enhance myself and my career with programming and software related skills?",
        "content": "I work in inventory control for a shipping company. I mainly track everything that arrives to and leaves from our warehouses and anticipate storage needs throughout the year. I enjoy the field and I want to continue to expand in logistics in general, but I want be able to offer more than just being an inventory clerk. I really enjoy the strategic and macro aspects of my job and I want to double down on that in the long run for future opportunities. I would like to get into more of the data analytics side of logistics and how that contributes to strategic decision making. Without having to go back to school for a new degree, what are some areas/tangible skills I can focus on learning in order to get to this goal? Programming related or otherwise",
        "subreddit": "logistics",
        "author": "Lohengramm44",
        "upvotes": 4,
        "created_at": "2024-10-29T03:49:22+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gelrlr/what_should_i_focus_on_learning_if_i_want_to/",
        "comments": [
            {
                "author": "Suitable-Scholar-778",
                "content": "SAP. learn s/4 HANA",
                "upvotes": 2,
                "created_at": "2024-10-29T11:45:09+00:00"
            },
            {
                "author": "Lolszakjak",
                "content": "Learn how to use FlexSim and how to make process models in it.",
                "upvotes": 1,
                "created_at": "2024-10-29T12:07:08+00:00"
            }
        ]
    },
    {
        "id": "1gegwah",
        "title": "CET exam SF95",
        "content": "They did a CET exam on my container and I got charged a boatload from the company that took my container and 2 of my coffee bags were broken and cut. When submitting the SF95 for the bags, can I only recoup the coffee bags cut or can I recoup the charges I got from the trucking company for their “fees”",
        "subreddit": "logistics",
        "author": "GoSmokeAJeffrey",
        "upvotes": 3,
        "created_at": "2024-10-28T23:46:15+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gegwah/cet_exam_sf95/",
        "comments": [
            {
                "author": "Infinite-Car-6704",
                "content": "CET Exams are contraband exams. The search for illicit drugs, and restricted items entering US Commerce. US CBP (Customs) has the authority to open the sealed container and open each box, coffee bag to inspect for \"such\" items. You will not be able to recoup any fee's paid to the exam station, exam station trucker, and the ocean carrier.  These are all costs associated with the exam that the importer on record has to bare unfortunately.",
                "upvotes": 2,
                "created_at": "2024-10-29T03:04:50+00:00"
            }
        ]
    },
    {
        "id": "1gecnx8",
        "title": "Seeking Pre-pull service near Houston port - 50 40FT containers/month",
        "content": "We're looking for a pre-pull service yard in the Houston area. We handle around 50 40FT containers a month. Best quote we've received so far is $300 per pre-pull.\n\nWe started our own logistics division where we'll haul our own freight with our drivers/trucks/chassis but what I'm not sure is the 'suite of chassis' and 'interchange agreement' how that would work with a prepull service?\n\nWe started this division to save on freight. So anything we can do to save freight expense - we'd consider it.",
        "subreddit": "logistics",
        "author": "chereddit",
        "upvotes": 3,
        "created_at": "2024-10-28T20:44:00+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gecnx8/seeking_prepull_service_near_houston_port_50_40ft/",
        "comments": [
            {
                "author": "Infinite-Car-6704",
                "content": "To be honest,, you don't really need Pre-Pull in Houston. Houston is one of those efficient ports. But I understand if you need to pre-pull to save $$$ on getting those boxes out before the last free day. Let me know how I can help. PM ME!",
                "upvotes": 2,
                "created_at": "2024-10-28T23:37:30+00:00"
            },
            {
                "author": "Dazzling-Kick4643",
                "content": "Check your mesaage \n\nI need more details.",
                "upvotes": 1,
                "created_at": "2024-10-28T21:24:23+00:00"
            },
            {
                "author": "Puzzled_Office_9433",
                "content": "I can beat that price of $300. Pm me and let me know more details!",
                "upvotes": 1,
                "created_at": "2024-10-29T15:36:25+00:00"
            },
            {
                "author": "Ten-4RubberDucky",
                "content": "You're getting raped for a $300 pre-pull.  If that's pre-pull plus flip, that's a different story.",
                "upvotes": 1,
                "created_at": "2024-10-31T00:42:01+00:00"
            },
            {
                "author": "LogisticsHero1",
                "content": "I can certainly get this taken care of for you!! We specialize in pre pull services and have these capabilities in Houston!! Send me an email and let me take care of this for you! Pmccarthy@tql.com or shoot me a text at 3306051562 and we can set up a call!",
                "upvotes": 0,
                "created_at": "2024-10-30T15:03:53+00:00"
            }
        ]
    },
    {
        "id": "1ge92qy",
        "title": "What is the correct way to report these items in aes? Do I actually need a separate HTS code for each item?",
        "content": "",
        "subreddit": "logistics",
        "author": "Independent_Cat_4834",
        "upvotes": 4,
        "created_at": "2024-10-28T18:17:05+00:00",
        "url": "https://i.redd.it/w1jmspjsgjxd1.jpeg",
        "comments": [
            {
                "author": "thespanishgerman",
                "content": "You can summarize by HTS code, filing multiple lines with the same HTS code in one position. \n\nPersonal effects have their own HTS code, that would be an exception to summarize all of them in one position.",
                "upvotes": 10,
                "created_at": "2024-10-28T18:41:50+00:00"
            },
            {
                "author": "PreludeTilTheEnd",
                "content": "Check the Schedule B. If line item over $2500, then file AES.",
                "upvotes": 2,
                "created_at": "2024-10-28T19:02:19+00:00"
            },
            {
                "author": "rockyroad55",
                "content": "You can put the furniture together, kitchenware can be together if same material, personal effects can be one, tools can be together as well manual vs power tools.",
                "upvotes": 2,
                "created_at": "2024-10-28T20:23:12+00:00"
            },
            {
                "author": "Firm-Faithlessness81",
                "content": "Be wary though, if the same material, same HTS/classification.. CBP can give you a hard time if you group it unless it's all invoiced on the same company invoice. \n\nEssentially they ask for 1 customs invoice per customer billing invoice. Unless you're doing a consolidated entry.",
                "upvotes": 2,
                "created_at": "2024-10-28T21:49:51+00:00"
            },
            {
                "author": "Infinite-Car-6704",
                "content": "Typically, for AES or EEI filings, each line item that needs reporting must be worth $2500 or more. If they do not, you can use the exemption filing code for the export.",
                "upvotes": 1,
                "created_at": "2024-10-28T23:35:39+00:00"
            }
        ]
    },
    {
        "id": "1ge7t8h",
        "title": "Which presidential candidate is better for container shipping:",
        "content": "",
        "subreddit": "logistics",
        "author": "charlesholmes1",
        "upvotes": 0,
        "created_at": "2024-10-28T17:25:52+00:00",
        "url": "/r/LogisticsHub/comments/1ge7svf/which_presidential_candidate_is_better_for/",
        "comments": [
            {
                "author": "Dagobian_Fudge",
                "content": "It depends if you profit off of volatility or prefer stable costs.",
                "upvotes": 6,
                "created_at": "2024-10-28T17:38:49+00:00"
            },
            {
                "author": "DVOlimey",
                "content": "Boaty McBoat face",
                "upvotes": 4,
                "created_at": "2024-10-28T18:39:15+00:00"
            },
            {
                "author": "Onni06",
                "content": "**If Trump Wins**\n\nTrade with China:\n\nI think if Trump wins the presidency the amount of imports and exports will decrease by a lot since Trump says he is going to increasae the tariffs on countries like china, looking for a more isolationism policy, this would most likely be met with retaliation from the counter parts, meaning tariffs on US products. \n\nAlso if trump were to truly do what he is saying, trying to bring back jobs to the US, he would have to put tariffs on all american products made in low income countries, meaning that the amount of shipping will decrease.\n\nTrade with EU:\n\nIf trump were to put tariffs on european products I dont see it working out well if the EU retaliats and puts a tariff on american products, because one of the largest trade partners for any european country is the U.S.\n\nOverall of trump wins the election I think that the amount of supply will be far excedding the demand meaning a contraction in that market.\n\n**If Kamala Wins**\n\nIf Kamala Harris wins it will be more or less the same as the Biden admistration for the logistics industry.",
                "upvotes": 2,
                "created_at": "2024-10-30T14:22:10+00:00"
            },
            {
                "author": "NighthawkT42",
                "content": "Trump isn't really looking for tariffs. He's looking to get the Chinese negotiating. Whether he can actually do that is the question.",
                "upvotes": 2,
                "created_at": "2024-11-03T12:40:05+00:00"
            },
            {
                "author": "DrCoknballsII",
                "content": "If better for container shipping you mean how well the containers travel into the ports then it’s a wash.\n\nNow if you don’t care to pay a 60% tariff on the goods to pick up that container….",
                "upvotes": 4,
                "created_at": "2024-10-28T18:45:28+00:00"
            }
        ]
    },
    {
        "id": "1ge4zge",
        "title": "Where might I be able to find more competitive rates for parcel shipments from the US to UK/EU?",
        "content": "Looking for help shipping cosmetics over to the EU These are low value B2B (warehouse) shipments ($800-2,000) usually, going to the UK, and soon Spain, France, Sweden, Denmark.  Also most (not all) going to Amazon warehouses. \n\nWe have a higher dim factor with UPS which makes them competitive with Amazon's partnered provider: ECMS.  Just sent two 21x16x16 - 48lb boxes for ~$250 with ECMS whereas UPS Expedited was only $260 USD.  \nSince ECMS took forever to consolidate, I probably won't use them again.  Bonus points for inexpensive brokerage options (if not an express carrier that handles it themselves).\n\n*Should mention we are shipping from the midatlantic US",
        "subreddit": "logistics",
        "author": "UH2000",
        "upvotes": 3,
        "created_at": "2024-10-28T15:32:31+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1ge4zge/where_might_i_be_able_to_find_more_competitive/",
        "comments": [
            {
                "author": "WolverinePrimary1802",
                "content": "I can absolutely help you with this, I have a dedicated import/export team with my company. \n\nShoot me over a message and lets see how much I can help ya.",
                "upvotes": 1,
                "created_at": "2024-10-28T16:22:44+00:00"
            },
            {
                "author": "mlopez1120",
                "content": "Try passportshipping, i use them when i ship to overseas from our Fulfillment centers in GA and CA",
                "upvotes": 1,
                "created_at": "2024-10-28T20:30:49+00:00"
            },
            {
                "author": "GrouchyAd927",
                "content": "If you’re not in a super rural area, I can get you much better pricing than $260 per shipment. Are you open to dm?",
                "upvotes": 1,
                "created_at": "2024-10-28T23:10:17+00:00"
            },
            {
                "author": "Aware-Leather-8992",
                "content": "No",
                "upvotes": 1,
                "created_at": "2024-10-29T02:12:18+00:00"
            },
            {
                "author": "qholley",
                "content": "Hey! I work with a Worldwide 3PL! I’ve had multiple clients with situations like this. If you want to shoot me a DM, I’m sure I could help!",
                "upvotes": 1,
                "created_at": "2024-10-30T01:27:06+00:00"
            }
        ]
    },
    {
        "id": "1ge3e1p",
        "title": "3PL in NL",
        "content": "The USA based company I work for is expanding on a project that will be delivering products across Benelux.  I am looking for recommendations for midsize 3PL companies located in NL. If you have any experience with what companies to avoid, that would also be helpful. ",
        "subreddit": "logistics",
        "author": "Brilliant-Law-2180",
        "upvotes": 1,
        "created_at": "2024-10-28T14:27:10+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1ge3e1p/3pl_in_nl/",
        "comments": [
            {
                "author": "AutoModerator",
                "content": "This post was made by /u/Brilliant-Law-2180 whom does not meet the the minimum karma requirement that is readily available in this subreddit rules. This rule exists to encourage posters to be users whom contribute to the subreddit in the comments before posting to everyone in this subreddit. Please participate before posting.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/logistics) if you have any questions or concerns.*",
                "upvotes": 1,
                "created_at": "2024-10-28T14:27:10+00:00"
            }
        ]
    },
    {
        "id": "1ge09mp",
        "title": "Is US warehouse real estate making a comeback?",
        "content": "The pandemic-fueled e-commerce boom led to a surge in warehouse construction. With change (should we say reduced) in demand  the warehouse market seems to be cooling down in the last few years.\n\nAre we overbuilt, or is there still room for growth in strategic locations? Also Amazon seems to be quietly adding back storage spaces again. Will we witness the resurgence of warehouse real estate? \n",
        "subreddit": "logistics",
        "author": "Tall_Photo2616",
        "upvotes": 1,
        "created_at": "2024-10-28T12:01:46+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1ge09mp/is_us_warehouse_real_estate_making_a_comeback/",
        "comments": [
            {
                "author": "Hobbz-",
                "content": "It will make a comeback overall.  For the simple reason that our need moving product through the supply chain continues to grow.\n\nBack in 2020, many companies scrambled to find warehouse space to overcome the flow interruptions.  Some segments are seeing a retraction over the past year and this was not a surprise.  There are two main reasons.  First is that with the flow of goods restored to a more steady and reliable movement, there is less need to hold excess inventory and pay extra for contingency plans.  Second is that companies are reevaluating their supply chain networks to ensure the operations are optimized.  Many short-term decisions were made in 2020 that can be improved upon now that life is back to a more steady state.",
                "upvotes": 3,
                "created_at": "2024-10-28T20:30:57+00:00"
            },
            {
                "author": "Federal-Mistake5208",
                "content": "Here in california many investors are switching from multi family to flex space due to being a tenant friendly state and less rules and regs to kick tenants out.",
                "upvotes": 3,
                "created_at": "2024-10-28T20:44:57+00:00"
            },
            {
                "author": "scmsteve",
                "content": "We will grow back into any vacant space very soon. We have not seen the ceiling of e-commerce growth.",
                "upvotes": 2,
                "created_at": "2024-10-28T13:32:10+00:00"
            },
            {
                "author": "DrJJStroganoff",
                "content": "Considering the e-commerce folks' de minimis exemption entries are coming to an end...  I am guessing yes warehousing will make a comeback.",
                "upvotes": 2,
                "created_at": "2024-10-28T14:19:47+00:00"
            },
            {
                "author": "Educational_Feed_776",
                "content": "Here in Southern Oregon we have too many warehouses and no tenants",
                "upvotes": 1,
                "created_at": "2024-10-29T16:43:47+00:00"
            }
        ]
    },
    {
        "id": "1gdxg4f",
        "title": "Hubs: how significant and novel?",
        "content": "Driving around I see many vast new warehouses next to main routes. How significant are these huge new buildings in the economy? What did we do without them, and why are they here now?",
        "subreddit": "logistics",
        "author": "sgt102",
        "upvotes": 1,
        "created_at": "2024-10-28T08:54:41+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gdxg4f/hubs_how_significant_and_novel/",
        "comments": [
            {
                "author": "BigBrainMonkey",
                "content": "How much more is purchased online and shipped now. It comes from somewhere and companies figured out the close you are to customers the faster and often cheaper the shipping.",
                "upvotes": 1,
                "created_at": "2024-10-28T11:51:19+00:00"
            },
            {
                "author": "blechie",
                "content": "Might also be to make supply chains more robust after all the disruption we’ve seen over the last few years with anything from labor shortage to foreign trade issues; and/or to make for faster delivery.",
                "upvotes": 1,
                "created_at": "2024-10-29T12:38:33+00:00"
            }
        ]
    },
    {
        "id": "1gdsaej",
        "title": "In the Weeds",
        "content": "I work for a global 3PL company in the transportation side of things. As most in logistics we are currently in peak season and simultaneously took on a huge, also global, very strict new customer right before peak started… My job uses temp labor as most do for lower level and entry positions and let’s just say I’m in the weeds because everybody keeps quitting. \n\nI’m an assistant operations manager for a shift that doesn’t have an actual manager on it. All of my workers are temp and the turnover is extremely high due to the stress of peak and the complexity of this new customers YMS. I’m having to train a new person every few weeks and having to repeat myself so many times has actually made me physically uncomfortable lol. This new major customer is very strict and none (0/4) of the shifts are properly staffed, and because I am one of the 2 people in my department that is systematically savvy with all 3 of our YMS’s (the other one being the senior operations manager over 4 buildings so he’s in the weeds too) everything systematical falls on me. everything…between all 4 shifts. \n\ni work 3 12’s (fri/sat/sun) so i usually end up taking my work home with me and go in during the week to help as well. i have had to talk myself down from walking out every single day of my work week this week because im having to fix all 4 shift’s errors and run my own operation at the same time. \n\nAny advice to keep things running smoothly and/or to keep myself sane during this devastatingly understaffed peak season please send it my way 🥲🩷",
        "subreddit": "logistics",
        "author": "mothersufferr",
        "upvotes": 6,
        "created_at": "2024-10-28T02:53:27+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gdsaej/in_the_weeds/",
        "comments": [
            {
                "author": "bac0467",
                "content": "Have you written down an SOP so you don’t have to keep explaining yourself or outlining every process?",
                "upvotes": 4,
                "created_at": "2024-10-28T02:56:20+00:00"
            },
            {
                "author": "gm4dm101",
                "content": "Transportation logistics is such a pain.  I don’t blame those employees for leaving.  The situation is just bad.  I would love to know a place that had “good” transportation logistics.",
                "upvotes": 3,
                "created_at": "2024-10-28T06:53:12+00:00"
            }
        ]
    },
    {
        "id": "1gdc1jc",
        "title": "Suggestions on international shippers for a single CTN (laptop)",
        "content": "Hi eceryone!\n\nI used to work in logistics, but mostly sea and air freight. Also I was on the managerial and finance end of things, so my knowledge is better than most folks but slightly limited.\n\nLooking to import a new laptop for myself into South Africa from the US. It's exorbitantly expensive to buy it here (like $1k markup), so getting it from my family in the US is probably ideal. I am a US citizen too, so not just trying to nab a deal by importing from random countries.\n\nDHL has quoted me about $450 which is still extremely steep, plus any duties I might get hit with. Shipping it to a residential address so hopefully that will favor me there.\n\nCan anyone make any suggestions on a shipper or forwarder who could do this at a significantly lower cost? I know it won't be $50 but closer to $200 I can stomach.\n\nObviously as an alternative, some trusted friends are looking into visiting me here, and I'm asking to see when they might, and if they could bring it with them.\n\nGoing to reach out to some of my old forwarder contacts too. Thanks for any suggestions.",
        "subreddit": "logistics",
        "author": "AssistancePretend668",
        "upvotes": 2,
        "created_at": "2024-10-27T14:21:43+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gdc1jc/suggestions_on_international_shippers_for_a/",
        "comments": [
            {
                "author": "More-Actuator-1729",
                "content": "Ask your pals to carry the laptop along with them. Not just cheaper , but much safer.",
                "upvotes": 3,
                "created_at": "2024-10-27T14:50:29+00:00"
            }
        ]
    },
    {
        "id": "1gc8aj6",
        "title": "NEED HELP FINDING GRAPPLER TRUCKS FOR SUNDAY!!!!!!!!",
        "content": "I have an emergency! My grappler drivers are unable to make it to Florida this Sunday, and I'm at a loss for where to find more grapplers. The person I was working with had a lot of equipment and was my go-to, but now that he backed out, I don’t know what to do. The pay for this job is quite good because it's a FEMA project focused on cleaning up debris. I've searched almost every regular load board, including Bulk Loads. Does anyone know of a company that specializes in grapplers or end dumps with grapplers? Thanks in advance. ",
        "subreddit": "logistics",
        "author": "Radiant-Emu-8859",
        "upvotes": 6,
        "created_at": "2024-10-25T23:54:25+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gc8aj6/need_help_finding_grappler_trucks_for_sunday/",
        "comments": [
            {
                "author": "Hungry_Equivalent_28",
                "content": "Better start dialing off of google bud.",
                "upvotes": 3,
                "created_at": "2024-10-26T06:43:09+00:00"
            },
            {
                "author": "Theriddler130284",
                "content": "I can feel your panic from here :(",
                "upvotes": 3,
                "created_at": "2024-10-26T08:03:33+00:00"
            },
            {
                "author": "TryingAllDayEveryDay",
                "content": "Try BBL Freight - Chance or Frank - they are amazing and in Florida",
                "upvotes": 3,
                "created_at": "2024-10-27T01:06:20+00:00"
            },
            {
                "author": "Suitable-Scholar-778",
                "content": "Ouch.  Hope you find your trucks",
                "upvotes": 2,
                "created_at": "2024-10-26T11:38:17+00:00"
            },
            {
                "author": "LogisticsHero1",
                "content": "I can handle this for you here at TQL! We can assist in providing any type of equipment or services you need for this FEMA project and any future work! Let me shoot you some quotes and see what we can do for you! My email is pmccarthy@tql.com or you can shoot me a text to set up a call 3306051562",
                "upvotes": 1,
                "created_at": "2024-10-30T15:07:58+00:00"
            }
        ]
    },
    {
        "id": "1gc79ku",
        "title": "anyone know where i can buy reefer pricing historical data in the US (with columns for chill vs. fzn, pallet qty, net weight, cube, and pickup/dropoff location)?",
        "content": "one of my projects at my job is to build a statistical learning model to get a better sense of freight rates for cost accounting. I have an idea of how to implement it and what regressors to use (including LTL vs FTL, which i forgot to put in title), but our internal data set is not huge and i would prefer to have additional data to train and test the model on. i have permission from my employer to purchase more data from an external source if i can find it (on company dime of course). anyone have an idea where i could do this? we are in the food industry which is why reefers are of particular interest. ",
        "subreddit": "logistics",
        "author": "Stunning_Shake407",
        "upvotes": 1,
        "created_at": "2024-10-25T23:03:18+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gc79ku/anyone_know_where_i_can_buy_reefer_pricing/",
        "comments": [
            {
                "author": "OnAMission0806",
                "content": "maybe like an RFQ from frozen food express (LTL carrier who moves frozen and chill",
                "upvotes": 1,
                "created_at": "2024-10-26T00:47:07+00:00"
            },
            {
                "author": "LogisticsHero1",
                "content": "I can provide you ALL of this data for any lane and any truck, shoot me a text and we can set up a call so I can get you all the info you need without charging you what major companies would do to have access to this data! 3306051562",
                "upvotes": 1,
                "created_at": "2024-10-30T15:19:07+00:00"
            }
        ]
    },
    {
        "id": "1gc6i67",
        "title": "3rd update, really pissed",
        "content": "2 of the items out of my package are missing after the whole custom clearance shit and it finally arrive after a full month, 2 items are missing… were they destroyed?",
        "subreddit": "logistics",
        "author": "Slow_Macaron4453",
        "upvotes": 0,
        "created_at": "2024-10-25T22:26:32+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gc6i67/3rd_update_really_pissed/",
        "comments": [
            {
                "author": "bac0467",
                "content": "You need to work with the person who shipped it’s whatever company/agent they used. No one here will know for certain. Could have been seized, stolen etc",
                "upvotes": 7,
                "created_at": "2024-10-25T22:35:42+00:00"
            },
            {
                "author": "Philip_Caps",
                "content": "Is there anything liquid,powder or branded items inside the packages?\n\nIf it's maybe confiscated by the customs.",
                "upvotes": 1,
                "created_at": "2024-10-26T04:04:34+00:00"
            },
            {
                "author": "LogisticsHero1",
                "content": "Let us here at TQL handle the next shipment you have, we specialize in customs clearance, and our deliveries are on time!! Email me or shoot me a text so we can quote your next shipment and get it there exactly how it should! Pmccarthy@tql.com 3306051562",
                "upvotes": 1,
                "created_at": "2024-10-30T15:21:14+00:00"
            }
        ]
    },
    {
        "id": "1gbtnaj",
        "title": "Dray Request",
        "content": "Origin: New York, NY\nDestination: Island Park, NY 11558, USA\n\nCargo Type: 1 x 20' OT (Open Top) – Out of Gauge (OOG)\nDimensions: 2.70m (L) x 2.15m (W) x 3.00m (H)\nExcess Height: 65 cm (beyond standard container height)\n\nWeight: 20,944 lbs\nNCM Code: 8501.53.10 (Electric motors and generators)\n\nPlease provide your best rate for this move, including any additional costs associated with handling the over-height cargo, permits, and special equipment, if needed.",
        "subreddit": "logistics",
        "author": "xx_seif_xx",
        "upvotes": 0,
        "created_at": "2024-10-25T12:59:27+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gbtnaj/dray_request/",
        "comments": [
            {
                "author": "ISayMemeWrong",
                "content": "I need about tree fiddy",
                "upvotes": 3,
                "created_at": "2024-10-25T14:47:35+00:00"
            },
            {
                "author": "Ornery-Ideal5708",
                "content": "Last free day?",
                "upvotes": 2,
                "created_at": "2024-10-25T16:53:44+00:00"
            },
            {
                "author": "freightforwardus",
                "content": "Shot you a message!",
                "upvotes": 1,
                "created_at": "2024-10-25T17:29:29+00:00"
            },
            {
                "author": "bdb5780",
                "content": "Send me your info I'll quote",
                "upvotes": 1,
                "created_at": "2024-10-26T18:48:29+00:00"
            },
            {
                "author": "LogisticsHero1",
                "content": "Here at TQL we specialize in providing the lowest Drayage rates around!! Shoot me an email or text and we can shoot you our quote!! Pmccarthy@tql.com 3306051562",
                "upvotes": 1,
                "created_at": "2024-10-30T15:22:36+00:00"
            }
        ]
    },
    {
        "id": "1gb7wuj",
        "title": "What is CAF?",
        "content": "Currency Adjustment Factor.\n\nWhat is this? I am looking on it on a document and I would expect it to be a percentage (a factor) but it looks like a dollar amount. I don't know what it is for, how it is used. I want to be able to picture in my head what is going on that is being paid for. ",
        "subreddit": "logistics",
        "author": "The_Hermit_09",
        "upvotes": 6,
        "created_at": "2024-10-24T17:15:15+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gb7wuj/what_is_caf/",
        "comments": [
            {
                "author": "teshnair",
                "content": "The freight amount is calculated in USD globally, at least at most places, but these are covered by expenses in local currency - whether it be bunker in Singapore or port operations in Rotterdam or terminal charges in New York. The operations of a carrier get affected by the currency fluctuations that happen on a daily basis. Some currency changes can be so drastic that it affects the operability. This is addressed by the CAF. \nSome carriers, though few now, charge it as a % of the freight (they used to) but it is cumbersome to maintain so they have a lump sum dollar amount. It generally covers every situation but even if any drastic changes between one currency pair results in some operability issues it is compensated by the profit from another.",
                "upvotes": 8,
                "created_at": "2024-10-24T17:49:32+00:00"
            },
            {
                "author": "DeliveryDesperate643",
                "content": "Companies usually charge it at stupid % unless it’s pre negotiated. They usually says it’s to protect them self incase the currency dips. It’s more like just additional free revenue",
                "upvotes": 3,
                "created_at": "2024-10-24T18:37:33+00:00"
            },
            {
                "author": "bac0467",
                "content": "Without seeing the document in question I’d guess a currency conversion?",
                "upvotes": 2,
                "created_at": "2024-10-24T17:34:07+00:00"
            },
            {
                "author": "Suitable-Scholar-778",
                "content": "It hedges against currency fluctuations.",
                "upvotes": 2,
                "created_at": "2024-10-24T18:57:05+00:00"
            },
            {
                "author": "Maleficent-Theory908",
                "content": "Currency adjustment factor",
                "upvotes": 2,
                "created_at": "2024-10-24T19:00:36+00:00"
            }
        ]
    },
    {
        "id": "1gb4zzq",
        "title": "How to get customers FTL/Reefer",
        "content": "The title says it. I’ve been a Carrier Sales Rep for 4 years now and I really want to try and transition to the customer sales part just to make more money and I feel like is more fun. I have tried and have never had luck so just curious how I can be better at trying to get customers",
        "subreddit": "logistics",
        "author": "LouSassle2697",
        "upvotes": 1,
        "created_at": "2024-10-24T15:13:24+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gb4zzq/how_to_get_customers_ftlreefer/",
        "comments": [
            {
                "author": "reabsco",
                "content": "Dialing for dollars, my guy. Find a data base that has refrigerated type of products and start reaching out. You are trading baseball cards... They have a carrier or broker already, you are hoping to catch them when they have an issue with them. Good luck.",
                "upvotes": 7,
                "created_at": "2024-10-24T16:23:48+00:00"
            },
            {
                "author": "Suitable-Scholar-778",
                "content": "You gotta know your shit and then start calling.  Stick to small to medium shippers that base shipping decisions on relationships until you learn to navigate the RFP processes. It's gonna be a grind,  but keep grinding",
                "upvotes": 5,
                "created_at": "2024-10-25T10:58:47+00:00"
            },
            {
                "author": "Useful_Imagination_3",
                "content": "As someone who has done both, customer side isn't more fun.  More money, yes, but definitely not more fun.",
                "upvotes": 3,
                "created_at": "2024-10-25T00:09:27+00:00"
            }
        ]
    },
    {
        "id": "1gazrz8",
        "title": "Inquiry Regarding Import/Export Compliance Consultation",
        "content": "Hey everyone,\n\nI’m looking for some advice on handling VAT and import costs for shipments we’re sending from a factory in Hong Kong directly to a client in the Netherlands. We manufacture knitwear and ship large orders for fashion brands, but lately, we’re getting hit with big charges on these shipments.\n\nWe’re paying around 30% in taxes, including 21% Dutch VAT, plus additional import duties and fees, which brings the total cost to nearly 50% of the goods' value. This is really cutting into our margins, and since this client makes up a big chunk of our business (20-30% of our yearly turnover), we need to figure out a better way to handle these costs.\n\n**A few questions:**\n\n1. **Recovering VAT:** Is there any way to get the Dutch VAT back? We get billed for it by DHL after the factory handles shipping. Could registering for VAT in the Netherlands help with this, or is there another option?\n2. **Reducing Import Costs:** Any tips on reducing import duties or fees? Are there ways to optimize with tariff codes, trade agreements, or something similar?\n3. **Shipping Strategies:** Would changing how we ship or handle customs make a difference in terms of reducing costs? Has anyone dealt with something similar?\n\nAny advice or suggestions would be really appreciated. This is a big client for us, but we need to make the numbers work better on these shipments.\n\nThanks in advance for the help!\n\n  \nEDIT: Sorry - I forgot to mention that we are based in the UK and our client is based in the UK. We send part of the shipment to their UK warehouse, and another part the their warehouse in the Netherlands. ",
        "subreddit": "logistics",
        "author": "Cyclingwithfriends",
        "upvotes": 3,
        "created_at": "2024-10-24T10:54:36+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gazrz8/inquiry_regarding_importexport_compliance/",
        "comments": [
            {
                "author": "SjordenD",
                "content": "Hi there,\n\n1. As a company within the EU, you’ll naturally get the import VAT refunded from the tax authorities.\n\n2. Customs duties, anti-dumping, etc. depend on the origin and the tariff number.\n\n3. Absolutely, customs clearance in Germany is quite different from places like Rotterdam or Antwerp, for example.\n\nIf you’d like to dive into the details, feel free to drop me a line at doeding@bluecont.de",
                "upvotes": 1,
                "created_at": "2024-10-24T11:20:19+00:00"
            },
            {
                "author": "SjordenD",
                "content": "Ok but then I would recommend to arrange customs in the name of the Dutch importer since it would save minimum 21% which is huge and there is no disadvantage for your customer in the Netherlands. \n\nIf you are scared that your customer could find out about your supplier in HK, we could clear it as an triangle biz without any reference to your supplier. \n\nOtherwise you could found a small branch in the EU, maybe just an by laywer without any real office and clear customs in that name and get the return auf the VAT.",
                "upvotes": 1,
                "created_at": "2024-10-24T11:33:23+00:00"
            },
            {
                "author": "jrmpt",
                "content": "The first advice is to stop handling VAT/duty for the importer. This is for the importer or importer customs broker.\n\nYou sell exempted because you are exporting. When entering the EU, the import is subject to VAT and duty. The importer should pay the VAT and seek reimbursement from the local customs via monthly declaration. They can get VAT reimbursement while you can't. For the duty, if any, he can pay it also and then seek reimbursement from you.\n\n  \nI have a customer who sends containers from Israel to Portugal. He agreed to Delivery Duty Paid with the BUYER. We clear the container using the Importer's VAT and charge the importer the duty. Then, we send the exporter a copy of the import customs clearance that shows the VAT/DUTY with instructions to reimburse the buyer for the duty.\n\n  \n[https://i.postimg.cc/YSr3r8rw/Untitled-1.jpg](https://i.postimg.cc/YSr3r8rw/Untitled-1.jpg)\n\nField 47  \nA00: DUTY, %6.5 on 32966.59€, 2142.83€. Paid by the importer who will seek reimbursement from the seller.\n\nB00: VAT, 23% on 35302.47, 8119.57€. Paid by the importer but refundable via the local VAT scheme.\n\nWe also attach the customs payment receipt to the clearance to prove the amounts have been indeed paid.",
                "upvotes": 1,
                "created_at": "2024-10-24T11:35:29+00:00"
            },
            {
                "author": "No_Acanthisitta2746",
                "content": "You can also appoint a fiscal rep there who can work as your proxy.\n\nIt also helps you get setup will local VAT.\n\nNetherlands is great because you can use postponed VAT accounting, so just accounting for VAT not paying.\n\nNo way round duties but you can with build into price or bill out to your customer. \n\nHappy to put you in touch with a supplier should you need it.",
                "upvotes": 1,
                "created_at": "2024-10-24T19:04:40+00:00"
            },
            {
                "author": "Philip_Caps",
                "content": "We're a freight forwarding company in China,maybe we can have a talk about the shipping to see if there's any chance to cut down the shipping fee for you.\n\nWhatsapp:+86 13316238701.",
                "upvotes": 1,
                "created_at": "2024-10-26T04:16:03+00:00"
            }
        ]
    },
    {
        "id": "1gaawun",
        "title": "Cross-docked item in a bonded warehouse.",
        "content": "Hi all. \n\nThe title says it all really. My company is looking into bonded warehousing. We have products that are cross-docked (this is due to vendor lead times etc etc). I'm curious as to how they will work in a bonded warehouse. Or is it simply a case of being bonded would have no impact and they would be great the same as all other goods. ",
        "subreddit": "logistics",
        "author": "blueduckpale",
        "upvotes": 3,
        "created_at": "2024-10-23T13:44:22+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1gaawun/crossdocked_item_in_a_bonded_warehouse/",
        "comments": [
            {
                "author": "prayersforrain",
                "content": "Bonded warehouses allow for delay of payment of duties/taxes.  That's it.",
                "upvotes": 5,
                "created_at": "2024-10-23T13:51:47+00:00"
            },
            {
                "author": "mlopez1120",
                "content": "I think your question is if you can still crossdock non-bonded goods correct? The answer is yes, the only liability you incur is if CBP performs an inspection and the items they flag should have records of what it is and it's current entry status (inbond/cleared). Best practice is to outlay the flooring of your warehouse to clearly distinguish where bonded goods are stored. Usually, this is already setup as CBP performs accreditation checks when approving bonded facilities. Hope this helps!",
                "upvotes": 3,
                "created_at": "2024-10-23T16:34:28+00:00"
            },
            {
                "author": "Suitable-Scholar-778",
                "content": "This shouldn't have any effect on it.  The product will be taxed when it leaves, regardless of what else it leaves with.",
                "upvotes": 2,
                "created_at": "2024-10-23T14:40:07+00:00"
            },
            {
                "author": "Fragrant_Click8136",
                "content": "If you really want to understand this what it’s worth to you? A free chat in R/Logistics # Reddit?",
                "upvotes": 1,
                "created_at": "2024-10-23T15:13:38+00:00"
            },
            {
                "author": "BigBrainMonkey",
                "content": "You’d have to make sure it was moving into warehouse in bond and out as well. For most supply chains I’ve seen unless a portion of product was going to be re- exported immediately it probably isn’t worth the hassle and paperwork since it doesn’t extend the free time like it would a traditional bonded warehouse.\n\nEdit: re-exported.",
                "upvotes": 1,
                "created_at": "2024-10-23T20:45:54+00:00"
            }
        ]
    },
    {
        "id": "1ga47ru",
        "title": "What is the best cheap way to ship car parts from China to Europe",
        "content": "Hello, I am looking to transport body parts for my vehicle, (Bumper, engine hood, right wing, radiator, grill and right lights) from China to Lithuania The shipping quote from the dealer was 1500 usd, that price is not acceptable for me. I am in no rush, the delivery time can take up to 30-40 days. ",
        "subreddit": "logistics",
        "author": "Active_Willingness97",
        "upvotes": 3,
        "created_at": "2024-10-23T06:50:56+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1ga47ru/what_is_the_best_cheap_way_to_ship_car_parts_from/",
        "comments": [
            {
                "author": "PJ-time",
                "content": "Check your incoterms as if it is not DDP you will have import taxes too",
                "upvotes": 2,
                "created_at": "2024-10-23T11:10:34+00:00"
            },
            {
                "author": "No_Acanthisitta2746",
                "content": "It will be longer than 40 days. \nNo sount suez is closed.\n\nIs this a door 2 door quote?",
                "upvotes": 1,
                "created_at": "2024-10-23T08:16:50+00:00"
            },
            {
                "author": "yourefunny",
                "content": "Container is on its way to us from China. Left on 2nd Oct. Delays mean it is likely not arriving in to the UK until 28th Nov. 30-40 days is not happening at the moment. Red sea issues.",
                "upvotes": 1,
                "created_at": "2024-10-23T12:58:05+00:00"
            },
            {
                "author": "soulkeyy",
                "content": "These are parts will big volume. You wont find price much cheaper than 1500usd.",
                "upvotes": 1,
                "created_at": "2024-10-23T17:58:49+00:00"
            },
            {
                "author": "Fragrant_Click8136",
                "content": "The Silk Road it’s if you want to pay less the $1500 .. No cigar here",
                "upvotes": 1,
                "created_at": "2024-10-23T23:52:57+00:00"
            }
        ]
    },
    {
        "id": "1ga1m8g",
        "title": "Healthcare professional looking at the business side of things.",
        "content": "I’m wondering if anyone has made the transition from healthcare to supply chain or materials management. Wondering how materials management is and how they like the position.  ",
        "subreddit": "logistics",
        "author": "Pure_Hour8623",
        "upvotes": 3,
        "created_at": "2024-10-23T04:02:09+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1ga1m8g/healthcare_professional_looking_at_the_business/",
        "comments": []
    },
    {
        "id": "1g9wn23",
        "title": "Update from my last reddit post! About it spending 25+ days in customs",
        "content": "",
        "subreddit": "logistics",
        "author": "Slow_Macaron4453",
        "upvotes": 8,
        "created_at": "2024-10-22T23:45:39+00:00",
        "url": "https://i.redd.it/10sz1hyx9ewd1.jpeg",
        "comments": [
            {
                "author": "LogisticsProConnect",
                "content": "Who is the importer of record (IOR) listed on the shipping paperwork? The IOR is the responsible party in the destination country for resolving customs related issues on a shipment. Try working with them to figure out why the shipment is held up in customs.",
                "upvotes": 2,
                "created_at": "2024-10-23T00:36:39+00:00"
            },
            {
                "author": "420fanman",
                "content": "I’m confused, your last post says you bought a package from China. Yet the point of origin on your tracking shows Illinois?",
                "upvotes": 1,
                "created_at": "2024-10-23T00:06:46+00:00"
            }
        ]
    },
    {
        "id": "1g9taw1",
        "title": "What are some types of logistics companies?",
        "content": "Sea Logistics (like Kuehne Nagel) \n\nTrucking carriers (assert-based) \n\nAir Logistics (like FedEx) \n\nContainer Shipping (like Hapag Lloyd) \n\nFreight Forwarders\n\nFreight Brokers\n\n\n\n\n\nYes I am aware that companies do a lot more than their main focus services. \n\nAny other type of companies in logistics? \n",
        "subreddit": "logistics",
        "author": "iolitm",
        "upvotes": 11,
        "created_at": "2024-10-22T21:14:26+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1g9taw1/what_are_some_types_of_logistics_companies/",
        "comments": [
            {
                "author": "McSterling83",
                "content": "Have you thought about moving and relocation companies? That's a huge niche that covers not only personal effects but also the transport of art, vehicles of any type and exhibitions.\n\nFreight forwarders and nvoccs tend not to cover these requirements because they are very specialised and require a different expertise than general cargo.",
                "upvotes": 5,
                "created_at": "2024-10-22T21:20:54+00:00"
            },
            {
                "author": "reabsco",
                "content": "3PL & 4PL companies that are able to do a combination of services. I work for JD.com, we have planes, warehouses, ships, & trucks. Some are not at every location, so we outsource to fill in the service.",
                "upvotes": 2,
                "created_at": "2024-10-22T22:06:30+00:00"
            },
            {
                "author": "Kodiak01",
                "content": "Kuehne Nagel does a lot more than just sea-based movements.  They were a regular customer of mine at the airline cargo docks back in the day.",
                "upvotes": 1,
                "created_at": "2024-10-22T21:39:25+00:00"
            },
            {
                "author": "StupidCobra",
                "content": "I work for a truck and trailer sales company. Odd kind of logistics work but I have to arrange moves to our locations and to customers. We also have a service side so there is someone working with parts",
                "upvotes": 1,
                "created_at": "2024-10-23T02:17:37+00:00"
            },
            {
                "author": "hinasilica",
                "content": "It depends on what you consider a logistics company, but I might consider customs brokerages as logistics since they’re a required service for all international shipments. They do more than just clear customs as well, they can make a huge difference in supply chain in general.",
                "upvotes": 1,
                "created_at": "2024-10-23T03:41:20+00:00"
            }
        ]
    },
    {
        "id": "1g9sh9c",
        "title": "Is it viable to create a package forwarding business using a 3PL or similar provider?",
        "content": "I've discovered a niche of delivery services that most merchants don't support since they require merchant integration. I'm exploring the idea of creating a package forwarding service. The idea being that I can provide a standard address, receive their package from UPS/FedEx/etc, then forward the package through the desired delivery service as I would integrate with these other delivery services. \n\nIs this something that is feasible to do? Are there 3PL providers that can intake a single package and ship it out (ideally with no warehousing) for a reasonable fee?  \n  \nI don't know much about 3PL or logistics, so I'm fairly out of my depth on the logistics side of this idea. ",
        "subreddit": "logistics",
        "author": "leros",
        "upvotes": 2,
        "created_at": "2024-10-22T20:40:04+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1g9sh9c/is_it_viable_to_create_a_package_forwarding/",
        "comments": [
            {
                "author": "First_Status668",
                "content": "I don't really see a widely known use case for this type of service because of how prevalent po boxes, parcel lockers and postal annexes are.  However, I have worked with several companies that do this for international shipments where the end customers don't have a means of shipping into themselves since they're not in the US.  What type of shipments/products are you envisioning?",
                "upvotes": 4,
                "created_at": "2024-10-23T02:20:11+00:00"
            },
            {
                "author": "GrouchyAd927",
                "content": "There are a lot of services out there that do this. Shipito, MyUS, and PlanetExpress are a few examples.",
                "upvotes": 3,
                "created_at": "2024-10-22T21:14:56+00:00"
            },
            {
                "author": "AZWL3PL",
                "content": "I run a 3PL in AZ I'm interested in the idea and we currently do case/shipment forwarding for FBA. Sounds similar to what your trying to do",
                "upvotes": 1,
                "created_at": "2024-10-23T15:59:35+00:00"
            }
        ]
    },
    {
        "id": "1g9pg7m",
        "title": "Bill of Lading formatting",
        "content": "I work for a company that primarily ships domestic to retailers. We've been having a hard time holding our carriers accountable(ltl) for claims as they typically go by pallet count and our claims come in as piece count. Currently we use a very generic BOL that gives the option of \nCounted by shipper\nCounted by driver as STC\nCounted by driver/pieces. \nDue to the volume of cases on our pallets its not realistic to expect a ltl driver to breakdown and count 20 pallets of freight when they all contain 300+ pieces. \nLooking for some creative wording or BOL formatting to put a little more liability on the carrier for the items within a pallet. \nSo many of my issues would be alleviated if the receivers would remember to mark whether the shrink wrap was in tact or not upon delivery. Wishful thinking. ",
        "subreddit": "logistics",
        "author": "Right_Inside_44",
        "upvotes": 3,
        "created_at": "2024-10-22T18:35:51+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1g9pg7m/bill_of_lading_formatting/",
        "comments": [
            {
                "author": "420fanman",
                "content": "Carrier liability usually start at $0.10 per pound and up. You either need to buy additional insurance and declare the appropriate value of your goods, or enter into a partnership with a carrier and develop terms with them. \n\nAmending your BOL isn’t going to do much in this case.\n\nEdit: The reason why I say amending the BOL isn’t going to do much is because you’re likely hitting the minimum covered value by the carrier. You can amend the UOM (how many cases per pallet, how many units per case), and do what others have also suggested of wrapping and securing the shipment. But that is all moot if you don’t have the adequate insurance coverage for your load. Clarify your insurance coverage first.",
                "upvotes": 9,
                "created_at": "2024-10-22T18:48:05+00:00"
            },
            {
                "author": "Asleep-Classic-966",
                "content": "Are you banding your pallets and wrapping them with multiple layers from ground up? As a carrier, we get so many pallets where someone walked around the middle of the pallet twice with a roll of shrink wrap and calls it good. \nUnless you want to pay for the carrier to count cartons and restack all your pallets, you’ll have to eat it on a missing carton or two or get your customers to properly receive and notate.",
                "upvotes": 6,
                "created_at": "2024-10-22T19:17:12+00:00"
            },
            {
                "author": "Buster_Bluth__",
                "content": "I think part of the issue here is how you are preparing the shipments.  \n\nI would order custom branded tape e.g. tape jungle where you can put your company logo on it.  If shrinkwrap is removed it would be difficult to duplicate the tape.  There are some additional things you can do to avoid counterfeit tape being made dm and I'll let you know there.  \n\nThis security tape should be applied 3 horizontal lined completely around and 2 vertical on each side going over the top.  \n\nYou could also look at d-containers.\n\nWe were able to get our claimed shortages to zero for over the past 18 months by doing this.",
                "upvotes": 5,
                "created_at": "2024-10-22T19:13:56+00:00"
            },
            {
                "author": "pleaseleevmealone",
                "content": "I usually put pallet number and number of cartons per pallet in the bottom section. I always try to keep the majority of skids with the same # of cartons, then the last skid is whatever is left. That way our warehouse knows all pallets should look identical except for one, if two are short, they lost cartons in transit. \n\nThis may help you with carrier liability but I've never actually had a claim paid because of it. I am more likely to use it to ask the carrier to look for the missing product and ship it over.",
                "upvotes": 2,
                "created_at": "2024-10-22T18:55:06+00:00"
            },
            {
                "author": "Street-Baseball8296",
                "content": "What do your pallets look like before they get loaded? Are they being stacked/wrapped properly?\n\nAre your claims for damages or shorts?\n\nIs this happening to multiple customers or just one?\n\nHow are you sure this isn’t an operational issue on your end?",
                "upvotes": 2,
                "created_at": "2024-10-22T19:52:13+00:00"
            }
        ]
    },
    {
        "id": "1g9p4ap",
        "title": "MSC container status update",
        "content": "We have a container with out house goods shipped from Kuwait to Texas - the online container tracking on MSC website had 3 updates, all together at the same time in below order:\n\n1. Import positioning in\n2. Import positioning out\n3. Full availability for delivery\n\nWhat does this mean? Is the custom clearance completed and the container is now ready for inland transport?\n\nThis is at Bayport in Houston, TX",
        "subreddit": "logistics",
        "author": "Eastern-Orange3393",
        "upvotes": 0,
        "created_at": "2024-10-22T18:22:05+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1g9p4ap/msc_container_status_update/",
        "comments": [
            {
                "author": "prayersforrain",
                "content": "yes",
                "upvotes": 1,
                "created_at": "2024-10-22T18:26:04+00:00"
            },
            {
                "author": "PreludeTilTheEnd",
                "content": "Available for delivery",
                "upvotes": 1,
                "created_at": "2024-10-22T19:59:13+00:00"
            },
            {
                "author": "Oldtrafford1991619",
                "content": "It depends whether these points are highlighted or just mentioned. The current status is always highlighted so that gives you the current status.",
                "upvotes": 1,
                "created_at": "2024-10-25T16:37:14+00:00"
            },
            {
                "author": "LogisticsHero1",
                "content": "Next time you need a more smooth import experience, use TQL I can make this more seamless for you with clear communication, tracking and lower rates! Shoot me an email and I’ll quote you next import, export or basic shipment! Pmccarthy@tql.com",
                "upvotes": 1,
                "created_at": "2024-10-30T15:31:09+00:00"
            }
        ]
    },
    {
        "id": "1g9jc9l",
        "title": "EORI implications for US business?",
        "content": "I ship consumer orders worldwide from the US, and do not collect VAT or any other international tax. I ship via USPS or UPS, with Shopify's standard labels that include HS codes and country of origin. I never did anything about the changes in 2009, and have continued to ship to Europe without an IOSS or any other kind of VAT handling, there have been no issues so far and customers are charged for their country's import taxes upon delivery.\n\nI now have an order shipped via UPS to France which UPS is holding in Kentucky customs and has contacted the importer/recipient requesting information, either my \"EORI\" or her SIREN number (I'm not clear which exactly). However in the event France is requiring my business have an EORI, are there any implications to registering one and providing it to UPS that could cost me money? I need to ensure it is clear that I have NOT collected VAT from the customer and do not pay these fees on their behalf. I want to ensure having an EORI will not result in me receiving a bill or any issues related to the customer's import duties in her country.",
        "subreddit": "logistics",
        "author": "chad917",
        "upvotes": 0,
        "created_at": "2024-10-22T14:22:26+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1g9jc9l/eori_implications_for_us_business/",
        "comments": [
            {
                "author": "LogisticsProConnect",
                "content": "EORI is essentially for import/export control so the EU knows what’s coming and going. The EORI # should be for the receiver / sold to, and does not have any financial implications for you. Ask the receiver for their EORI and then provide it to UPS. Only the receiver’s EORI is needed in this transaction, you as the US shipper will not need your own EORI.",
                "upvotes": 3,
                "created_at": "2024-10-22T14:45:55+00:00"
            },
            {
                "author": "PreludeTilTheEnd",
                "content": "Exporter do not need EORI.",
                "upvotes": 2,
                "created_at": "2024-10-22T14:35:56+00:00"
            },
            {
                "author": "No_Acanthisitta2746",
                "content": "If you are shipping to a company or incorporated as you say in the states, then they must have a EORI number to act as the importer of record(IOR).\n\nIf you are shipping to a private individual then they must pay local taxes ahead of time.\n\nIf you want to ease the process in the EU you can appoint a fiscal rep locally act as your proxy.\n\nThere are tax implication as you may not be able to recover VAT in all areas. \n\nIf you want to know more just loop up fiscal rep EU",
                "upvotes": 1,
                "created_at": "2024-10-22T15:27:16+00:00"
            },
            {
                "author": "Pineapple_Lina",
                "content": "If your French customer is a business, ask them to provide you their EORI number. If it’s the first time ever they import something, then they shoud apply for it. The procedure takes 5 days as I remember.\n\nOn your customer is an individual, then I don’t know.",
                "upvotes": 1,
                "created_at": "2024-10-22T17:57:02+00:00"
            }
        ]
    },
    {
        "id": "1g9dz10",
        "title": "Container shipping delay estimate",
        "content": "Hi everyone,\n\nWe’ve booked a Maersk container to ship household items from Jebel Ali, Dubai (UAE) to Oakland, CA (USA), with a stop in Shanghai, China. The estimated arrival in Oakland, CA is December 21, 2024.\n\nIs there a way to predict potential delays more accurately? This is important as we need to plan hotel bookings accordingly.\n\nThanks!",
        "subreddit": "logistics",
        "author": "spicyjaym",
        "upvotes": 2,
        "created_at": "2024-10-22T09:22:07+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1g9dz10/container_shipping_delay_estimate/",
        "comments": [
            {
                "author": "SyrianDictator",
                "content": "In short, no. But always expect delays. Additionally, just because the eta at port is a certain date doesn't mean the cargo will be unloaded on that date. Anticipate an additional 15 days imo.",
                "upvotes": 8,
                "created_at": "2024-10-22T09:32:29+00:00"
            },
            {
                "author": "DVOlimey",
                "content": "I agree with the above, especially on a long transit such as yours. I would suggest checking on the container status and vessel location at least once per week. ETA means just that, estimated.",
                "upvotes": 2,
                "created_at": "2024-10-22T10:20:08+00:00"
            },
            {
                "author": "stevarino1979",
                "content": "Go with someone with industry experience.  They will know when delays may occur.  Right now, USWC is backed up 2-3 weeks from the USEC strike because there are not enough rail cars to bring more imports in. This problem should be cleared up in a few weeks, so it should not affect this too much. Maybe a few vessel changes while they reshuffle the schedules.",
                "upvotes": 1,
                "created_at": "2024-10-22T15:19:37+00:00"
            },
            {
                "author": "McSterling83",
                "content": "There's no way to estimate delays,but depending who and how the booking was placed with Maersk you may have more or less free container days in the US. \n\nI can help you to analyse / understand the information of your shipment, if you're interested. Just send me a PM.",
                "upvotes": 1,
                "created_at": "2024-10-22T21:51:14+00:00"
            },
            {
                "author": "Loguibear",
                "content": "easy mate ... just gotta predict the weather, the tides, potenital political / industrial actions, & different country regulations/ war / santions/ etc etc etc etc",
                "upvotes": 1,
                "created_at": "2024-10-23T07:49:15+00:00"
            }
        ]
    },
    {
        "id": "1g944qz",
        "title": "Job!!",
        "content": "Hey there my fellow logisticians, i just completed my diploma based on logistics and transport from my local universityand ill appreciate it if you guys can guide me on what jobs to apply and etc ill appreciate your help!!!",
        "subreddit": "logistics",
        "author": "OkListen4415",
        "upvotes": 1,
        "created_at": "2024-10-21T23:32:52+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1g944qz/job/",
        "comments": [
            {
                "author": "Moist-Golf-8339",
                "content": "I’m a logistics manager and I was a music performance major. Welcome to the party!",
                "upvotes": 5,
                "created_at": "2024-10-22T01:55:41+00:00"
            }
        ]
    },
    {
        "id": "1g8zsnu",
        "title": "First-time pallet buyer and LTL freight shopper",
        "content": "As title suggests, I bought my first pallet of electronics and need to coordinate LTL freight across the country.\nI’ve talked with the seller, who has assured me it’s been shrink-wrapped.\n\nAny advice for this first- timer?\nI live close enough to freight terminals in my region, I feel like I should ship there and pickup. Can any freight company ship to FedEx facility or only to their partners?\n\nAlso I’ve seen it advised to have sellers place signage saying “DO NOT STACK”\n\nAny other things I should absolutely do to avoid disaster?",
        "subreddit": "logistics",
        "author": "di-ty",
        "upvotes": 16,
        "created_at": "2024-10-21T20:23:51+00:00",
        "url": "https://i.redd.it/vogf7u0156wd1.jpeg",
        "comments": [
            {
                "author": "Chrintense",
                "content": "Truck with tailgate and pallet jack could drop this right at your driveway",
                "upvotes": 16,
                "created_at": "2024-10-21T20:40:54+00:00"
            },
            {
                "author": "oandakid718",
                "content": "Can you box them up before palletizing and shrink-wrapping?",
                "upvotes": 5,
                "created_at": "2024-10-21T20:41:18+00:00"
            },
            {
                "author": "ButWereFriends",
                "content": "They’re still probably gonna stack it on top of something else",
                "upvotes": 2,
                "created_at": "2024-10-21T21:44:45+00:00"
            },
            {
                "author": "ntwdequiptrans",
                "content": "Best to ship to terminal and pickup but make sure the shipper puts these in a Gaylord box on a pallet or at least a layer of cardboard in between each layer before shrink wrapping and banding.",
                "upvotes": 2,
                "created_at": "2024-10-22T00:20:23+00:00"
            },
            {
                "author": "Endless_Sedition",
                "content": "What is that crap?",
                "upvotes": 2,
                "created_at": "2024-10-22T00:54:16+00:00"
            }
        ]
    },
    {
        "id": "1g8p0g7",
        "title": "Aside from transit time, other benefits of shipping via Air (instead of Ocean)?",
        "content": "Is the customs process more expedited, is there less risk, etc? ",
        "subreddit": "logistics",
        "author": "No_UN216",
        "upvotes": 2,
        "created_at": "2024-10-21T12:56:06+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1g8p0g7/aside_from_transit_time_other_benefits_of/",
        "comments": [
            {
                "author": "ScottyR2287",
                "content": "Generally less damage with air vs ocean due to less time in transit and generally gentler handling process with air vs ocean. It does not change customs clearance that’s based on which type of clearance you use. You pay more for expedited customs clearance for product bound for the US. Since air arrives in 1-3 days via air vs 4-6 weeks for ocean -time and price are the big differences.",
                "upvotes": 6,
                "created_at": "2024-10-21T13:03:54+00:00"
            },
            {
                "author": "Maleficent-Theory908",
                "content": "Ocean guy here, try shipping an entire 40' container via air from shanghai to Dallas. The breakdown explains itself. Cost is considerably cheaper and slower but manageable with proper planning. The real mind boggler is where is the middle ground between the two? There isn't really. Depends on the product really. Appliances, construction and furniture are ocean bound or net loss in the end. Chips, processors and medical equipment can fly and maintain profits.  What you shipping? Apples to apples details needed for a real comparison. If its a pallet, air freight it.",
                "upvotes": 4,
                "created_at": "2024-10-21T14:18:23+00:00"
            },
            {
                "author": "WiglafsSwordandShiel",
                "content": "Less subject to macroeconomic climate:\n1. Fewer air cargo terminals are unionized, so you don’t have to worry about port strikes. \n2. More ports of termination means you can dodge port congestion if necessary.",
                "upvotes": 3,
                "created_at": "2024-10-21T19:03:23+00:00"
            },
            {
                "author": "hinasilica",
                "content": "I’m not sure I’d say there’s definitely less risk with air. If you book economy air and it’s hitting 2-4 airports along the way, often times the freight is being moved from one plane to the next. Air freight gets left behind or entirely lost much more than ocean freight. Plus terminals are a bitch tbh. Try getting your shipment out of an LAX terminal and you may have nightmares for years to come. I actually do, I have literally had nightmares about begging WFS to just give me my shipment while they hold it hostage for no reason. \n\nBut honestly we need more details to provide a true comparison, different shipments have different profiles and risks. And there’s plenty of pros and cons to all the options.",
                "upvotes": 3,
                "created_at": "2024-10-22T06:51:25+00:00"
            },
            {
                "author": "WatchOutForDeer12",
                "content": "Trade working capital",
                "upvotes": 1,
                "created_at": "2024-10-24T01:42:17+00:00"
            }
        ]
    },
    {
        "id": "1g8jk61",
        "title": "Promoted to parts coordinator. Any advice?",
        "content": "I work for a furniture company and recently got promoted as a parts coordinator. I gotta deal with keeping up with inventory of parts, ordering said parts, and making sure these things get to where they need to go. I was wondering if there are any apps or programs that make keeping track of all this 1000x easier. Any advice is also welcomed.",
        "subreddit": "logistics",
        "author": "BurntOkami",
        "upvotes": 5,
        "created_at": "2024-10-21T06:50:01+00:00",
        "url": "https://www.reddit.com/r/logistics/comments/1g8jk61/promoted_to_parts_coordinator_any_advice/",
        "comments": [
            {
                "author": "Suitable-Scholar-778",
                "content": "There are literally hundreds of inventory management programs that will do what you want.  You need to make a list of features that are: must have,  nice to have,  don't need. Then decide what your budget is and remember,  the higher your budget,  the more features you will likely have. Start googling and hit up the ones you like for demos",
                "upvotes": 2,
                "created_at": "2024-10-21T11:51:22+00:00"
            },
            {
                "author": "scmsteve",
                "content": "You are not using anything to keep track of inventory?",
                "upvotes": 2,
                "created_at": "2024-10-21T15:03:37+00:00"
            },
            {
                "author": "Psychodelta",
                "content": "5S\n\nGet organized as quickly as possible \n\nFix each SKU one by one...",
                "upvotes": 2,
                "created_at": "2024-10-21T15:29:06+00:00"
            }
        ]
    }
]